[Killed] ConditionalExpression
acceptance/assertions.ts:52:7
 
 export function scriptReferencedByResponse(world: World): string {
   const scripts = referencedScripts(observedResponse(world).body)
-  if (scripts.length === 0) {
+  if (false) {
     throw new Error('the index page references no script')
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| property/assertions.property.ts (24 tests | 1 failed) 384ms

   ❯ scriptReferencedByResponse (4)

     × refuses a page referencing no script, whatever else it references 22ms

[Killed] EqualityOperator
acceptance/assertions.ts:52:7
 
 export function scriptReferencedByResponse(world: World): string {
   const scripts = referencedScripts(observedResponse(world).body)
-  if (scripts.length === 0) {
+  if (scripts.length !== 0) {
     throw new Error('the index page references no script')
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| acceptance/assertions.spec.ts (7 tests | 3 failed) 23ms

   ❯ scriptReferencedByResponse (4)
     × returns the script the index page references 8ms

[Killed] ConditionalExpression
acceptance/assertions.ts:55:7
   if (scripts.length === 0) {
     throw new Error('the index page references no script')
   }
-  if (scripts.length > 1) {
+  if (true) {
     throw new Error(`the index page references more than one script: ${scripts.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| acceptance/assertions.spec.ts (7 tests | 1 failed) 28ms

   ❯ scriptReferencedByResponse (4)
     × returns the script the index page references 23ms

[Killed] EqualityOperator
acceptance/assertions.ts:55:7
   if (scripts.length === 0) {
     throw new Error('the index page references no script')
   }
-  if (scripts.length > 1) {
+  if (scripts.length >= 1) {
     throw new Error(`the index page references more than one script: ${scripts.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| acceptance/assertions.spec.ts (7 tests | 1 failed) 16ms

   ❯ scriptReferencedByResponse (4)
     × returns the script the index page references 9ms

[Killed] StringLiteral
acceptance/assertions.ts:56:85
     throw new Error('the index page references no script')
   }
   if (scripts.length > 1) {
-    throw new Error(`the index page references more than one script: ${scripts.join(', ')}`)
+    throw new Error(`the index page references more than one script: ${scripts.join("")}`)
   }
   return scripts[0]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| acceptance/assertions.spec.ts (7 tests | 1 failed) 65ms

   ❯ scriptReferencedByResponse (4)
     × refuses to guess when the page references more than one script 28ms

[Killed] BlockStatement
acceptance/assertions.ts:68:77
   }
 }
 
-export function responseContains(response: Response, content: string): void {
-  if (!response.body.includes(content)) {
-    throw new Error(`response body does not contain "${content}":\n${excerpt(response.body)}`)
-  }
-}
+export function responseContains(response: Response, content: string): void {}
 
 export function bodyContains(world: World, content: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 53ms

   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 12ms
     × contains reports the body it looked in 1ms

[Killed] BlockStatement
acceptance/assertions.ts:69:41
 }
 
 export function responseContains(response: Response, content: string): void {
-  if (!response.body.includes(content)) {
-    throw new Error(`response body does not contain "${content}":\n${excerpt(response.body)}`)
-  }
+  if (!response.body.includes(content)) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| acceptance/assertions.spec.ts (7 tests | 2 failed) 54ms

   ❯ responseContains (3)
     × rejects a body without the marker, quoting what it looked for 26ms
     × reports the body it looked in 1ms

[Killed] ConditionalExpression
acceptance/assertions.ts:69:7
 }
 
 export function responseContains(response: Response, content: string): void {
-  if (!response.body.includes(content)) {
+  if (true) {
     throw new Error(`response body does not contain "${content}":\n${excerpt(response.body)}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 175ms

   ❯ the response body (9)
     × contains accepts a substring anywhere in the body 53ms

[Killed] StringLiteral
acceptance/assertions.ts:70:21
 
 export function responseContains(response: Response, content: string): void {
   if (!response.body.includes(content)) {
-    throw new Error(`response body does not contain "${content}":\n${excerpt(response.body)}`)
+    throw new Error(``)
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| acceptance/assertions.spec.ts (7 tests | 2 failed) 61ms

   ❯ responseContains (3)
     × rejects a body without the marker, quoting what it looked for 38ms

[Killed] BlockStatement
acceptance/assertions.ts:74:67
   }
 }
 
-export function bodyContains(world: World, content: string): void {
-  responseContains(observedResponse(world), content)
-}
+export function bodyContains(world: World, content: string): void {}
 
 export function bodyExcludes(world: World, content: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 178ms
   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 40ms
     × contains reports the body it looked in 17ms
     × a body of exactly 400 characters is reported whole 1ms

[Killed] CallExpression
acceptance/assertions.ts:75:3
 }
 
 export function bodyContains(world: World, content: string): void {
-  responseContains(observedResponse(world), content)
+  ;
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 110ms

   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 32ms

[Killed] ConditionalExpression
acceptance/assertions.ts:80:7
 
 export function bodyExcludes(world: World, content: string): void {
   const { body } = observedResponse(world)
-  if (body.includes(content)) {
+  if (false) {
     throw new Error(`response body unexpectedly contains "${content}":\n${excerpt(body)}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 73ms
   ❯ the response body (9)
     × does-not-contain rejects a body that still has it 28ms

[Killed] BlockStatement
acceptance/assertions.ts:94:28
 
 export function everyAssetRespondsWith(world: World, expected: string): void {
   const assets = world.assets ?? []
-  if (assets.length === 0) {
-    throw new Error('no referenced assets were requested in this scenario')
-  }
+  if (assets.length === 0) {}
   const failures = assets.filter((asset) => asset.status !== Number(expected))
   if (failures.length > 0) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 111ms

   ❯ every referenced asset responds (5)
     × an unasked scenario fails rather than passing vacuously 21ms
     × an empty asset list fails the same way 1ms

[Killed] EqualityOperator
acceptance/assertions.ts:97:45
   if (assets.length === 0) {
     throw new Error('no referenced assets were requested in this scenario')
   }
-  const failures = assets.filter((asset) => asset.status !== Number(expected))
+  const failures = assets.filter((asset) => asset.status === Number(expected))
   if (failures.length > 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 129ms
   ❯ every referenced asset responds (5)
     × accepts when every asset carries the expected status 28ms
     × rejects when a single asset differs, naming that asset and its status 3ms
     × names every failing asset, not just the first 1

[Killed] MethodExpression
acceptance/assertions.ts:97:20
   if (assets.length === 0) {
     throw new Error('no referenced assets were requested in this scenario')
   }
-  const failures = assets.filter((asset) => asset.status !== Number(expected))
+  const failures = assets
   if (failures.length > 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 141ms

   ❯ every referenced asset responds (5)

     × accepts when every asset carries the expected status 24ms

[Killed] EqualityOperator
acceptance/assertions.ts:98:7
     throw new Error('no referenced assets were requested in this scenario')
   }
   const failures = assets.filter((asset) => asset.status !== Number(expected))
-  if (failures.length > 0) {
+  if (failures.length >= 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
       .map((asset) => `${asset.path} -> ${asset.status}`)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 119ms

   ❯ every referenced asset responds (5)
     × accepts when every asset carries the expected status 24ms

[Killed] EqualityOperator
acceptance/assertions.ts:106:7
 }
 
 export function nothingReferences(reference: string, offenders: string[]): void {
-  if (offenders.length > 0) {
+  if (offenders.length <= 0) {
     throw new Error(`"${reference}" still appears in ${offenders.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 142ms

   ❯ a location contains no reference (3)
     × accepts when nothing referenced it 46ms
     × rejects on one offender, naming it 4ms

[Killed] StringLiteral
acceptance/assertions.ts:107:71
 
 export function nothingReferences(reference: string, offenders: string[]): void {
   if (offenders.length > 0) {
-    throw new Error(`"${reference}" still appears in ${offenders.join(', ')}`)
+    throw new Error(`"${reference}" still appears in ${offenders.join("")}`)
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 81ms

   ❯ a location contains no reference (3)
     × lists every offender 12ms

[Killed] ConditionalExpression
acceptance/assertions.ts:112:7
 }
 
 export function scriptIsAvailable(script: string, declared: string[]): void {
-  if (!declared.includes(script)) {
+  if (true) {
     throw new Error(`package.json declares no "${script}" script; it has: ${declared.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 108ms
   ❯ an npm script is available (3)
     × accepts a declared script 29ms

[Killed] ConditionalExpression
acceptance/assertions.ts:112:7
 }
 
 export function scriptIsAvailable(script: string, declared: string[]): void {
-  if (!declared.includes(script)) {
+  if (false) {
     throw new Error(`package.json declares no "${script}" script; it has: ${declared.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 108ms
   ❯ an npm script is available (3)
     × rejects an undeclared script and lists what is declared 46ms
     × matches a whole script name, not a prefix of one 6ms

[Killed] EqualityOperator
acceptance/assertions.ts:127:7
 }
 
 export function majorVersionIsAtLeast(major: number, minimum: string): void {
-  if (major < Number(minimum)) {
+  if (major <= Number(minimum)) {
     throw new Error(`TypeScript major version ${major} is below the required ${minimum}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 139ms

   ❯ the compiler major version (4)
     × accepts a version exactly at the minimum 60ms

[Killed] EqualityOperator
acceptance/assertions.ts:127:7
 }
 
 export function majorVersionIsAtLeast(major: number, minimum: string): void {
-  if (major < Number(minimum)) {
+  if (major >= Number(minimum)) {
     throw new Error(`TypeScript major version ${major} is below the required ${minimum}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-5PcAgh


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 150ms

   ❯ the compiler major version (4)
     × accepts a version above the minimum 58ms
     × accepts a version exactly at the minimum 1ms
