[Killed] MethodExpression
acceptance/inspection.ts:14:59
 
 const unquoted = (attribute: string): string => attribute.slice(1, -1)
 
-const referencedStylesheets = (html: string): string[] => [...html.matchAll(LINK_TAG)]
-  .filter((link) => STYLESHEET_REL.test(link[0]))
+const referencedStylesheets = (html: string): string[] => [...html.matchAll(LINK_TAG)]
   .map((link) => HREF_ATTRIBUTE.exec(link[0]))
   .filter((href): href is RegExpExecArray => href !== null)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22


 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 1 failed) 104ms

   ❯ referencedAssets (5)
     × ignores links that are not stylesheets 41ms

[Killed] ArrowFunction
acceptance/inspection.ts:15:11
 const unquoted = (attribute: string): string => attribute.slice(1, -1)
 
 const referencedStylesheets = (html: string): string[] => [...html.matchAll(LINK_TAG)]
-  .filter((link) => STYLESHEET_REL.test(link[0]))
+  .filter(() => undefined)
   .map((link) => HREF_ATTRIBUTE.exec(link[0]))
   .filter((href): href is RegExpExecArray => href !== null)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22


 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 1 failed) 37ms

   ❯ referencedAssets (5)
     × finds script sources and stylesheet hrefs 28ms

[Killed] ConditionalExpression
acceptance/inspection.ts:17:46
 const referencedStylesheets = (html: string): string[] => [...html.matchAll(LINK_TAG)]
   .filter((link) => STYLESHEET_REL.test(link[0]))
   .map((link) => HREF_ATTRIBUTE.exec(link[0]))
-  .filter((href): href is RegExpExecArray => href !== null)
+  .filter((href): href is RegExpExecArray => false)
   .map((href) => unquoted(href[1]))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22



 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 1 failed) 48ms

   ❯ referencedAssets (5)
     × finds script sources and stylesheet hrefs 26ms

[Killed] StringLiteral
acceptance/inspection.ts:31:21
 export function compilerMajorVersion(versionOutput: string): number {
   const banner = VERSION_BANNER.exec(versionOutput)
   if (!banner) {
-    throw new Error(`no compiler version in output: ${versionOutput.trim()}`)
+    throw new Error(``)
   }
   return Number(banner[1])
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22



 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 1 failed) 62ms

   ❯ compilerMajorVersion (3)
     × fails on output that carries no version 35ms

[Killed] OptionalChaining
acceptance/inspection.ts:50:19
 // a command and its arguments separated by whitespace; a script needing shell
 // syntax to be understood would have to be read some other way.
 export function scriptArgv(manifestText: string, name: string): string[] {
-  const command = declaredScripts(manifestText)[name]?.trim()
+  const command = declaredScripts(manifestText)[name].trim()
   if (!command) {
     throw new Error(`package.json declares no "${name}" script to run`)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22


 ❯ |mutation| property/inspection.property.ts (12 tests | 1 failed) 355ms
   ❯ scriptArgv (4)
     × refuses any name the manifest does not declare a command for, and says which 57ms

 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 1 failed) 35ms

[Killed] MethodExpression
acceptance/inspection.ts:50:19
 // a command and its arguments separated by whitespace; a script needing shell
 // syntax to be understood would have to be read some other way.
 export function scriptArgv(manifestText: string, name: string): string[] {
-  const command = declaredScripts(manifestText)[name]?.trim()
+  const command = declaredScripts(manifestText)[name]
   if (!command) {
     throw new Error(`package.json declares no "${name}" script to run`)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22



 ❯ |mutation| property/inspection.property.ts (12 tests | 2 failed) 316ms

   ❯ scriptArgv (4)
     × reads the same argv however much whitespace separates it 26ms

[Killed] ConditionalExpression
acceptance/inspection.ts:51:7
 // syntax to be understood would have to be read some other way.
 export function scriptArgv(manifestText: string, name: string): string[] {
   const command = declaredScripts(manifestText)[name]?.trim()
-  if (!command) {
+  if (false) {
     throw new Error(`package.json declares no "${name}" script to run`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22



 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 2 failed) 63ms

   ❯ scriptArgv (4)

[Killed] ConditionalExpression
acceptance/inspection.ts:51:7
 // syntax to be understood would have to be read some other way.
 export function scriptArgv(manifestText: string, name: string): string[] {
   const command = declaredScripts(manifestText)[name]?.trim()
-  if (!command) {
+  if (true) {
     throw new Error(`package.json declares no "${name}" script to run`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22



 ❯ |mutation| property/inspection.property.ts (12 tests | 2 failed) 468ms

   ❯ scriptArgv (4)

[Killed] Regex
acceptance/inspection.ts:54:24
   if (!command) {
     throw new Error(`package.json declares no "${name}" script to run`)
   }
-  return command.split(/\s+/)
+  return command.split(/\S+/)
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22


 ❯ |mutation| acceptance/inspection.spec.ts (17 tests | 2 failed) 23ms
   ❯ scriptArgv (4)
     × reads the argv of the script the manifest declares 11ms
     × keeps a command that takes no arguments whole 1ms

[Killed] Regex
acceptance/inspection.ts:54:24
   if (!command) {
     throw new Error(`package.json declares no "${name}" script to run`)
   }
-  return command.split(/\s+/)
+  return command.split(/\s/)
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-eYLq22



 ❯ |mutation| property/inspection.property.ts (12 tests | 1 failed) 426ms

   ❯ scriptArgv (4)
