[Killed] EqualityOperator
acceptance/assertions.ts:33:3
 const EXCERPT_LIMIT = 400
 
 const excerpt = (body: string): string =>
-  body.length > EXCERPT_LIMIT ? `${body.slice(0, EXCERPT_LIMIT)}...` : body
+  body.length <= EXCERPT_LIMIT ? `${body.slice(0, EXCERPT_LIMIT)}...` : body
 
 export function observedResponse(world: World): Response {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 75ms

   ❯ the response body (9)
     × a body of exactly 400 characters is reported whole 16ms

[Killed] MethodExpression
acceptance/assertions.ts:33:36
 const EXCERPT_LIMIT = 400
 
 const excerpt = (body: string): string =>
-  body.length > EXCERPT_LIMIT ? `${body.slice(0, EXCERPT_LIMIT)}...` : body
+  body.length > EXCERPT_LIMIT ? `${body}...` : body
 
 export function observedResponse(world: World): Response {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 124ms

   ❯ the response body (9)

[Killed] ConditionalExpression
acceptance/assertions.ts:44:7
 
 export function assetsReferencedByResponse(world: World): string[] {
   const assets = referencedAssets(observedResponse(world).body)
-  if (assets.length === 0) {
+  if (false) {
     throw new Error('the index page references no scripts or stylesheets')
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 58ms
   ❯ the assets the index page references (3)
     × an index page referencing nothing is a failure, not an empty pass 16ms

[Killed] ConditionalExpression
acceptance/assertions.ts:44:7
 
 export function assetsReferencedByResponse(world: World): string[] {
   const assets = referencedAssets(observedResponse(world).body)
-  if (assets.length === 0) {
+  if (true) {
     throw new Error('the index page references no scripts or stylesheets')
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 42ms
   ❯ the assets the index page references (3)
     × are read out of the response the scenario has already made 11ms

[Killed] BlockStatement
acceptance/assertions.ts:50:64
   return assets
 }
 
-export function statusIs(world: World, expected: string): void {
-  const { status } = observedResponse(world)
-  if (status !== Number(expected)) {
-    throw new Error(`expected status ${expected} but got ${status}`)
-  }
-}
+export function statusIs(world: World, expected: string): void {}
 
 export function bodyContains(world: World, content: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 31ms
   ❯ the response status (4)
     × rejects any other status, reporting both 8ms
     × compares numerically, so 200 does not satisfy an expectation of 2000 1ms

[Killed] ConditionalExpression
acceptance/assertions.ts:52:7
 
 export function statusIs(world: World, expected: string): void {
   const { status } = observedResponse(world)
-  if (status !== Number(expected)) {
+  if (false) {
     throw new Error(`expected status ${expected} but got ${status}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 59ms

   ❯ the response status (4)
     × rejects any other status, reporting both 14ms

[Killed] BlockStatement
acceptance/assertions.ts:52:36
 
 export function statusIs(world: World, expected: string): void {
   const { status } = observedResponse(world)
-  if (status !== Number(expected)) {
-    throw new Error(`expected status ${expected} but got ${status}`)
-  }
+  if (status !== Number(expected)) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 72ms
   ❯ the response status (4)
     × rejects any other status, reporting both 18ms
     × compares numerically, so 200 does not satisfy an expectation of 2000 2ms

[Killed] BlockStatement
acceptance/assertions.ts:57:67
   }
 }
 
-export function bodyContains(world: World, content: string): void {
-  const { body } = observedResponse(world)
-  if (!body.includes(content)) {
-    throw new Error(`response body does not contain "${content}":\n${excerpt(body)}`)
-  }
-}
+export function bodyContains(world: World, content: string): void {}
 
 export function bodyExcludes(world: World, content: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 83ms

   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 18ms

[Killed] ConditionalExpression
acceptance/assertions.ts:59:7
 
 export function bodyContains(world: World, content: string): void {
   const { body } = observedResponse(world)
-  if (!body.includes(content)) {
+  if (false) {
     throw new Error(`response body does not contain "${content}":\n${excerpt(body)}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 55ms
   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 14ms
     × contains reports the body it looked in 1ms

[Killed] BlockStatement
acceptance/assertions.ts:59:32
 
 export function bodyContains(world: World, content: string): void {
   const { body } = observedResponse(world)
-  if (!body.includes(content)) {
-    throw new Error(`response body does not contain "${content}":\n${excerpt(body)}`)
-  }
+  if (!body.includes(content)) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 85ms

   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 26ms

[Killed] StringLiteral
acceptance/assertions.ts:60:21
 export function bodyContains(world: World, content: string): void {
   const { body } = observedResponse(world)
   if (!body.includes(content)) {
-    throw new Error(`response body does not contain "${content}":\n${excerpt(body)}`)
+    throw new Error(``)
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 48ms

   ❯ the response body (9)
     × contains rejects a substring the body lacks, quoting what was wanted 11ms

[Killed] BlockStatement
acceptance/assertions.ts:64:67
   }
 }
 
-export function bodyExcludes(world: World, content: string): void {
-  const { body } = observedResponse(world)
-  if (body.includes(content)) {
-    throw new Error(`response body unexpectedly contains "${content}":\n${excerpt(body)}`)
-  }
-}
+export function bodyExcludes(world: World, content: string): void {}
 
 export function bodyEquals(world: World, expected: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 42ms
   ❯ the response body (9)
     × does-not-contain rejects a body that still has it 15ms

[Killed] ConditionalExpression
acceptance/assertions.ts:66:7
 
 export function bodyExcludes(world: World, content: string): void {
   const { body } = observedResponse(world)
-  if (body.includes(content)) {
+  if (true) {
     throw new Error(`response body unexpectedly contains "${content}":\n${excerpt(body)}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 51ms

   ❯ the response body (9)
     × does-not-contain accepts a body without the text 14ms

[Killed] BlockStatement
acceptance/assertions.ts:66:31
 
 export function bodyExcludes(world: World, content: string): void {
   const { body } = observedResponse(world)
-  if (body.includes(content)) {
-    throw new Error(`response body unexpectedly contains "${content}":\n${excerpt(body)}`)
-  }
+  if (body.includes(content)) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 101ms

   ❯ the response body (9)
     × does-not-contain rejects a body that still has it 13ms

[Killed] BlockStatement
acceptance/assertions.ts:71:66
   }
 }
 
-export function bodyEquals(world: World, expected: string): void {
-  const { body } = observedResponse(world)
-  if (body !== expected) {
-    throw new Error(`expected response body\n${expected}\nbut got\n${excerpt(body)}`)
-  }
-}
+export function bodyEquals(world: World, expected: string): void {}
 
 export function everyAssetRespondsWith(world: World, expected: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 76ms
   ❯ the response body (9)
     × equals rejects a body that merely contains the expected text 29ms

[Killed] ConditionalExpression
acceptance/assertions.ts:73:7
 
 export function bodyEquals(world: World, expected: string): void {
   const { body } = observedResponse(world)
-  if (body !== expected) {
+  if (true) {
     throw new Error(`expected response body\n${expected}\nbut got\n${excerpt(body)}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 88ms
   ❯ the response body (9)
     × equals accepts only the exact body 28ms

[Killed] EqualityOperator
acceptance/assertions.ts:73:7
 
 export function bodyEquals(world: World, expected: string): void {
   const { body } = observedResponse(world)
-  if (body !== expected) {
+  if (body === expected) {
     throw new Error(`expected response body\n${expected}\nbut got\n${excerpt(body)}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 117ms

   ❯ the response body (9)
     × equals accepts only the exact body 44ms
     × equals rejects a body that merely contains the expected text 10ms

[Killed] BlockStatement
acceptance/assertions.ts:78:78
   }
 }
 
-export function everyAssetRespondsWith(world: World, expected: string): void {
-  const assets = world.assets ?? []
-  if (assets.length === 0) {
-    throw new Error('no referenced assets were requested in this scenario')
-  }
-  const failures = assets.filter((asset) => asset.status !== Number(expected))
-  if (failures.length > 0) {
-    throw new Error(`assets did not respond with ${expected}: ${failures
-      .map((asset) => `${asset.path} -> ${asset.status}`)
-      .join(', ')}`)
-  }
-}
+export function everyAssetRespondsWith(world: World, expected: string): void {}
 
 export function nothingReferences(reference: string, offenders: string[]): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 4 failed) 68ms
   ❯ every referenced asset responds (5)
     × rejects when a single asset differs, naming that asset and its status 17ms
     × names every failing asset, not just the first 1ms
     × an unasked scenario fails rather than passing vacuously

[Killed] ConditionalExpression
acceptance/assertions.ts:80:7
 
 export function everyAssetRespondsWith(world: World, expected: string): void {
   const assets = world.assets ?? []
-  if (assets.length === 0) {
+  if (false) {
     throw new Error('no referenced assets were requested in this scenario')
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 92ms
   ❯ every referenced asset responds (5)
     × an unasked scenario fails rather than passing vacuously 19ms
     × an empty asset list fails the same way 7ms

[Killed] EqualityOperator
acceptance/assertions.ts:80:7
 
 export function everyAssetRespondsWith(world: World, expected: string): void {
   const assets = world.assets ?? []
-  if (assets.length === 0) {
+  if (assets.length !== 0) {
     throw new Error('no referenced assets were requested in this scenario')
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 5 failed) 61ms
   ❯ every referenced asset responds (5)
     × accepts when every asset carries the expected status 13ms
     × rejects when a single asset differs, naming that asset and its status 6ms

[Killed] ConditionalExpression
acceptance/assertions.ts:83:45
   if (assets.length === 0) {
     throw new Error('no referenced assets were requested in this scenario')
   }
-  const failures = assets.filter((asset) => asset.status !== Number(expected))
+  const failures = assets.filter((asset) => true)
   if (failures.length > 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 61ms
   ❯ every referenced asset responds (5)
     × accepts when every asset carries the expected status 12ms
     × rejects when a single asset differs, naming that asset and its status 7ms
     × names every failing asset, not just the first 1m

[Killed] ArrowFunction
acceptance/assertions.ts:83:34
   if (assets.length === 0) {
     throw new Error('no referenced assets were requested in this scenario')
   }
-  const failures = assets.filter((asset) => asset.status !== Number(expected))
+  const failures = assets.filter(() => undefined)
   if (failures.length > 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 113ms

   ❯ every referenced asset responds (5)

     × rejects when a single asset differs, naming that asset and its status 33ms

[Killed] ConditionalExpression
acceptance/assertions.ts:84:7
     throw new Error('no referenced assets were requested in this scenario')
   }
   const failures = assets.filter((asset) => asset.status !== Number(expected))
-  if (failures.length > 0) {
+  if (true) {
     throw new Error(`assets did not respond with ${expected}: ${failures
       .map((asset) => `${asset.path} -> ${asset.status}`)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 69ms
   ❯ every referenced asset responds (5)
     × accepts when every asset carries the expected status 17ms

[Killed] BlockStatement
acceptance/assertions.ts:84:28
     throw new Error('no referenced assets were requested in this scenario')
   }
   const failures = assets.filter((asset) => asset.status !== Number(expected))
-  if (failures.length > 0) {
-    throw new Error(`assets did not respond with ${expected}: ${failures
-      .map((asset) => `${asset.path} -> ${asset.status}`)
-      .join(', ')}`)
-  }
+  if (failures.length > 0) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 53ms
   ❯ every referenced asset responds (5)
     × rejects when a single asset differs, naming that asset and its status 17ms
     × names every failing asset, not just the first 1ms

[Killed] ArrowFunction
acceptance/assertions.ts:86:12
   const failures = assets.filter((asset) => asset.status !== Number(expected))
   if (failures.length > 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
-      .map((asset) => `${asset.path} -> ${asset.status}`)
+      .map(() => undefined)
       .join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 85ms

   ❯ every referenced asset responds (5)

     × rejects when a single asset differs, naming that asset and its status 23ms

[Killed] StringLiteral
acceptance/assertions.ts:87:13
   if (failures.length > 0) {
     throw new Error(`assets did not respond with ${expected}: ${failures
       .map((asset) => `${asset.path} -> ${asset.status}`)
-      .join(', ')}`)
+      .join("")}`)
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 73ms
   ❯ every referenced asset responds (5)
     × names every failing asset, not just the first 14ms

[Killed] BlockStatement
acceptance/assertions.ts:91:81
   }
 }
 
-export function nothingReferences(reference: string, offenders: string[]): void {
-  if (offenders.length > 0) {
-    throw new Error(`"${reference}" still appears in ${offenders.join(', ')}`)
-  }
-}
+export function nothingReferences(reference: string, offenders: string[]): void {}
 
 export function scriptIsAvailable(script: string, declared: string[]): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 42ms

   ❯ a location contains no reference (3)

[Killed] EqualityOperator
acceptance/assertions.ts:92:7
 }
 
 export function nothingReferences(reference: string, offenders: string[]): void {
-  if (offenders.length > 0) {
+  if (offenders.length >= 0) {
     throw new Error(`"${reference}" still appears in ${offenders.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 50ms
   ❯ a location contains no reference (3)
     × accepts when nothing referenced it 16ms

[Killed] BlockStatement
acceptance/assertions.ts:92:29
 }
 
 export function nothingReferences(reference: string, offenders: string[]): void {
-  if (offenders.length > 0) {
-    throw new Error(`"${reference}" still appears in ${offenders.join(', ')}`)
-  }
+  if (offenders.length > 0) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 74ms
   ❯ a location contains no reference (3)
     × rejects on one offender, naming it 14ms
     × lists every offender 1ms

[Killed] BlockStatement
acceptance/assertions.ts:97:77
   }
 }
 
-export function scriptIsAvailable(script: string, declared: string[]): void {
-  if (!declared.includes(script)) {
-    throw new Error(`package.json declares no "${script}" script; it has: ${declared.join(', ')}`)
-  }
-}
+export function scriptIsAvailable(script: string, declared: string[]): void {}
 
 export function compilationSucceeded(world: World): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 126ms

   ❯ an npm script is available (3)
     × rejects an undeclared script and lists what is declared 50ms

[Killed] BlockStatement
acceptance/assertions.ts:98:35
 }
 
 export function scriptIsAvailable(script: string, declared: string[]): void {
-  if (!declared.includes(script)) {
-    throw new Error(`package.json declares no "${script}" script; it has: ${declared.join(', ')}`)
-  }
+  if (!declared.includes(script)) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 124ms
   ❯ an npm script is available (3)
     × rejects an undeclared script and lists what is declared 28ms
     × matches a whole script name, not a prefix of one 1ms

[Killed] BooleanLiteral
acceptance/assertions.ts:98:7
 }
 
 export function scriptIsAvailable(script: string, declared: string[]): void {
-  if (!declared.includes(script)) {
+  if (declared.includes(script)) {
     throw new Error(`package.json declares no "${script}" script; it has: ${declared.join(', ')}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 126ms
   ❯ an npm script is available (3)
     × accepts a declared script 36ms
     × rejects an undeclared script and lists what is declared 12ms
     × matches a whole script name, not a prefix of one 1ms

[Killed] BlockStatement
acceptance/assertions.ts:103:58
   }
 }
 
-export function compilationSucceeded(world: World): void {
-  if (!world.compilation) {
-    throw new Error('the TypeScript compiler has not been run in this scenario')
-  }
-  if (world.compilation.code !== 0) {
-    throw new Error(`tsc exited ${world.compilation.code}:\n${world.compilation.output}`)
-  }
-}
+export function compilationSucceeded(world: World): void {}
 
 export function majorVersionIsAtLeast(major: number, minimum: string): void {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 2 failed) 62ms

   ❯ the compiler run (3)
     × rejects a non-zero exit, reporting the code and the output 28ms

[Killed] ConditionalExpression
acceptance/assertions.ts:107:7
   if (!world.compilation) {
     throw new Error('the TypeScript compiler has not been run in this scenario')
   }
-  if (world.compilation.code !== 0) {
+  if (true) {
     throw new Error(`tsc exited ${world.compilation.code}:\n${world.compilation.output}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 88ms

   ❯ the compiler run (3)
     × accepts exit code zero 32ms

[Killed] BlockStatement
acceptance/assertions.ts:107:37
   if (!world.compilation) {
     throw new Error('the TypeScript compiler has not been run in this scenario')
   }
-  if (world.compilation.code !== 0) {
-    throw new Error(`tsc exited ${world.compilation.code}:\n${world.compilation.output}`)
-  }
+  if (world.compilation.code !== 0) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz


 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 44ms
   ❯ the compiler run (3)
     × rejects a non-zero exit, reporting the code and the output 17ms

[Killed] BlockStatement
acceptance/assertions.ts:112:77
   }
 }
 
-export function majorVersionIsAtLeast(major: number, minimum: string): void {
-  if (major < Number(minimum)) {
-    throw new Error(`TypeScript major version ${major} is below the required ${minimum}`)
-  }
-}
+export function majorVersionIsAtLeast(major: number, minimum: string): void {}
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 49ms

   ❯ the compiler major version (4)

[Killed] ConditionalExpression
acceptance/assertions.ts:113:7
 }
 
 export function majorVersionIsAtLeast(major: number, minimum: string): void {
-  if (major < Number(minimum)) {
+  if (false) {
     throw new Error(`TypeScript major version ${major} is below the required ${minimum}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 1 failed) 73ms

   ❯ the compiler major version (4)
     × rejects a version below the minimum, reporting both 27ms

[Killed] ConditionalExpression
acceptance/assertions.ts:113:7
 }
 
 export function majorVersionIsAtLeast(major: number, minimum: string): void {
-  if (major < Number(minimum)) {
+  if (true) {
     throw new Error(`TypeScript major version ${major} is below the required ${minimum}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-UieVwz



 ❯ |mutation| hardening/assertions.hardening.ts (38 tests | 3 failed) 106ms

   ❯ the compiler major version (4)
     × accepts a version above the minimum 38ms
