[Killed] MethodExpression
acceptance/generator.ts:38:16
 export function metadataFileName(featurePath: string): string {
   // Collapsing every run of non-alphanumerics leaves at most one hyphen at
   // either end, so the trim has none to repeat.
-  const slug = featurePath.toLowerCase().replace(/[^a-z0-9]+/g, '-').replace(/^-|-$/g, '')
+  const slug = featurePath.toUpperCase().replace(/[^a-z0-9]+/g, '-').replace(/^-|-$/g, '')
   return `${slug}.json`
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 14ms

   ❯ the metadata file name (1)
     × leaves a hyphen inside the slug alone while trimming the ends 11ms

[Killed] Regex
acceptance/generator.ts:38:50
 export function metadataFileName(featurePath: string): string {
   // Collapsing every run of non-alphanumerics leaves at most one hyphen at
   // either end, so the trim has none to repeat.
-  const slug = featurePath.toLowerCase().replace(/[^a-z0-9]+/g, '-').replace(/^-|-$/g, '')
+  const slug = featurePath.toLowerCase().replace(/[a-z0-9]+/g, '-').replace(/^-|-$/g, '')
   return `${slug}.json`
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 29ms

   ❯ the metadata file name (1)
     × leaves a hyphen inside the slug alone while trimming the ends 19ms

[Killed] StringLiteral
acceptance/generator.ts:39:10
   // Collapsing every run of non-alphanumerics leaves at most one hyphen at
   // either end, so the trim has none to repeat.
   const slug = featurePath.toLowerCase().replace(/[^a-z0-9]+/g, '-').replace(/^-|-$/g, '')
-  return `${slug}.json`
+  return ``
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 29ms

   ❯ the metadata file name (1)
     × leaves a hyphen inside the slug alone while trimming the ends 21ms

[Killed] MethodExpression
acceptance/generator.ts:44:10
 
 export function relativeImportPath(fromDir: string, target: string): string {
   const importPath = posixRelative(fromDir, target)
-  return importPath.startsWith('.') ? importPath : `./${importPath}`
+  return importPath.endsWith('.') ? importPath : `./${importPath}`
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| acceptance/generator.spec.ts (20 tests | 2 failed) 45ms

   ❯ relativeImportPath (2)
     × walks up out of the generated directory to the acceptance sources 6ms

[Killed] StringLiteral
acceptance/generator.ts:44:52
 
 export function relativeImportPath(fromDir: string, target: string): string {
   const importPath = posixRelative(fromDir, target)
-  return importPath.startsWith('.') ? importPath : `./${importPath}`
+  return importPath.startsWith('.') ? importPath : ``
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 12ms

   ❯ an import path the generated file will be compiled with (1)
     × uses forward slashes whatever separator the platform reported 5ms

[Killed] MethodExpression
acceptance/generator.ts:49:22
 
 export function implementationHash(files: GeneratedFile[]): string {
   const digest = createHash('sha256')
-  for (const file of [...files].sort((left, right) => left.path.localeCompare(right.path))) {
+  for (const file of [...files]) {
     digest.update(`${file.path}\0${file.content}\0`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| acceptance/generator.spec.ts (20 tests | 1 failed) 42ms
   ❯ implementationHash (4)
     × does not depend on the order the generated files are listed in 17ms

[Killed] BlockStatement
acceptance/generator.ts:49:93
 
 export function implementationHash(files: GeneratedFile[]): string {
   const digest = createHash('sha256')
-  for (const file of [...files].sort((left, right) => left.path.localeCompare(right.path))) {
-    digest.update(`${file.path}\0${file.content}\0`)
-  }
+  for (const file of [...files].sort((left, right) => left.path.localeCompare(right.path))) {}
   return `sha256:${digest.digest('hex')}`
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| acceptance/generator.spec.ts (20 tests | 2 failed) 61ms

   ❯ implementationHash (4)
     × changes when generated content changes 12ms
     × distinguishes the same content under different file names 1ms

[Killed] StringLiteral
acceptance/generator.ts:52:10
   for (const file of [...files].sort((left, right) => left.path.localeCompare(right.path))) {
     digest.update(`${file.path}\0${file.content}\0`)
   }
-  return `sha256:${digest.digest('hex')}`
+  return ``
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| acceptance/generator.spec.ts (20 tests | 3 failed) 60ms

   ❯ implementationHash (4)

[Killed] StringLiteral
acceptance/generator.ts:63:5
     "import { afterAll, describe, test } from 'vitest'",
     `import type { Feature } from ${JSON.stringify(runtimeImport)}`,
     `import { expandScenarios, runExecution } from ${JSON.stringify(runtimeImport)}`,
-    `import { createWorld, releaseFixtures, stepHandlers } from ${JSON.stringify(stepsImport)}`,
+    ``,
     '',
     `const featureIr: Feature = JSON.parse(readFileSync(${JSON.stringify(irPath)}, 'utf8'))`,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 41ms

   ❯ the generated entry point (1)

     × is exactly the source the acceptance tier expects to run 39ms

[Killed] StringLiteral
acceptance/generator.ts:64:5
     `import type { Feature } from ${JSON.stringify(runtimeImport)}`,
     `import { expandScenarios, runExecution } from ${JSON.stringify(runtimeImport)}`,
     `import { createWorld, releaseFixtures, stepHandlers } from ${JSON.stringify(stepsImport)}`,
-    '',
+    "Stryker was here!",
     `const featureIr: Feature = JSON.parse(readFileSync(${JSON.stringify(irPath)}, 'utf8'))`,
     '',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 29ms
   ❯ the generated entry point (1)
     × is exactly the source the acceptance tier expects to run 27ms

[Killed] StringLiteral
acceptance/generator.ts:68:5
     `const featureIr: Feature = JSON.parse(readFileSync(${JSON.stringify(irPath)}, 'utf8'))`,
     '',
     `describe(${JSON.stringify(featureName)}, () => {`,
-    '  afterAll(releaseFixtures)',
+    "",
     '',
     '  for (const execution of expandScenarios(featureIr)) {',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 22ms

   ❯ the generated entry point (1)

[Killed] StringLiteral
acceptance/generator.ts:71:5
     '  afterAll(releaseFixtures)',
     '',
     '  for (const execution of expandScenarios(featureIr)) {',
-    '    test(execution.name, async () => {',
+    "",
     '      await runExecution(execution, stepHandlers, createWorld())',
     '    })',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 39ms
   ❯ the generated entry point (1)
     × is exactly the source the acceptance tier expects to run 37ms

[Killed] StringLiteral
acceptance/generator.ts:73:5
     '  for (const execution of expandScenarios(featureIr)) {',
     '    test(execution.name, async () => {',
     '      await runExecution(execution, stepHandlers, createWorld())',
-    '    })',
+    "",
     '  }',
     '})',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 26ms
   ❯ the generated entry point (1)
     × is exactly the source the acceptance tier expects to run 23ms

[Killed] StringLiteral
acceptance/generator.ts:75:5
     '      await runExecution(execution, stepHandlers, createWorld())',
     '    })',
     '  }',
-    '})',
+    "",
     '',
   ]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| hardening/generator.hardening.ts (3 tests | 1 failed) 24ms
   ❯ the generated entry point (1)
     × is exactly the source the acceptance tier expects to run 17ms

[Killed] ObjectLiteral
acceptance/generator.ts:98:20
     }),
   }
 
-  const document = {
-    schema_version: METADATA_SCHEMA_VERSION,
-    feature_path: featurePath,
-    ir_path: recordedIrPath,
-    implementation_hash: implementationHash([entrypoint]),
-    hash_scope: 'generated_files',
-    generated_files: [entrypoint.path],
-  }
+  const document = {}
 
   return {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz


 ❯ |mutation| property/generator.property.ts (15 tests | 3 failed) 263ms
   ❯ featureArtifacts (3)
     × hashes exactly the entry point it emits 33ms
     × records both artifacts as working-directory paths 10ms
     × writes metadata that parses back and ends with a newline 7ms

[Killed] StringLiteral
acceptance/generator.ts:103:17
     feature_path: featurePath,
     ir_path: recordedIrPath,
     implementation_hash: implementationHash([entrypoint]),
-    hash_scope: 'generated_files',
+    hash_scope: "",
     generated_files: [entrypoint.path],
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-lPgRAz



 ❯ |mutation| acceptance/generator.spec.ts (20 tests | 1 failed) 46ms

   ❯ featureArtifacts (5)
