[Killed] Regex
acceptance/inspection.ts:1:20
-const SCRIPT_SRC = /<script\b[^>]*\bsrc\s*=\s*("[^"]*"|'[^']*')[^>]*>/gi
+const SCRIPT_SRC = /<script\b[^>]\bsrc\s*=\s*("[^"]*"|'[^']*')[^>]*>/gi
 const LINK_TAG = /<link\b[^>]*>/gi
 const HREF_ATTRIBUTE = /\bhref\s*=\s*("[^"]*"|'[^']*')/i
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| property/inspection.property.ts (6 tests | 1 failed) 201ms

   ❯ referencedAssets (3)
     × finds every script and stylesheet the page references, in that order 35ms

[Killed] Regex
acceptance/inspection.ts:3:24
 const SCRIPT_SRC = /<script\b[^>]*\bsrc\s*=\s*("[^"]*"|'[^']*')[^>]*>/gi
 const LINK_TAG = /<link\b[^>]*>/gi
-const HREF_ATTRIBUTE = /\bhref\s*=\s*("[^"]*"|'[^']*')/i
+const HREF_ATTRIBUTE = /\bhref\S*=\s*("[^"]*"|'[^']*')/i
 const STYLESHEET_REL = /\brel\s*=\s*("stylesheet"|'stylesheet'|stylesheet\b)/i
 // The patch digits are matched but never read, so shortening the final
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 1 failed) 47ms

   ❯ reading asset references out of markup (8)
     × a stylesheet href surrounded by whitespace is still a reference 26ms

[Killed] Regex
acceptance/inspection.ts:3:24
 const SCRIPT_SRC = /<script\b[^>]*\bsrc\s*=\s*("[^"]*"|'[^']*')[^>]*>/gi
 const LINK_TAG = /<link\b[^>]*>/gi
-const HREF_ATTRIBUTE = /\bhref\s*=\s*("[^"]*"|'[^']*')/i
+const HREF_ATTRIBUTE = /\bhref\s=\s*("[^"]*"|'[^']*')/i
 const STYLESHEET_REL = /\brel\s*=\s*("stylesheet"|'stylesheet'|stylesheet\b)/i
 // The patch digits are matched but never read, so shortening the final
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 4 failed) 41ms

   ❯ reading asset references out of markup (8)
     × a rel attribute surrounded by whitespace still marks a stylesheet 19ms
     × an unquoted rel still marks a stylesheet 1ms

[Killed] Regex
acceptance/inspection.ts:4:24
 const SCRIPT_SRC = /<script\b[^>]*\bsrc\s*=\s*("[^"]*"|'[^']*')[^>]*>/gi
 const LINK_TAG = /<link\b[^>]*>/gi
 const HREF_ATTRIBUTE = /\bhref\s*=\s*("[^"]*"|'[^']*')/i
-const STYLESHEET_REL = /\brel\s*=\s*("stylesheet"|'stylesheet'|stylesheet\b)/i
+const STYLESHEET_REL = /\brel\s*=\s("stylesheet"|'stylesheet'|stylesheet\b)/i
 // The patch digits are matched but never read, so shortening the final
 // quantifier cannot change an answer this module gives. That makes Stryker's
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| property/inspection.property.ts (6 tests | 1 failed) 192ms

   ❯ referencedAssets (3)
     × finds every script and stylesheet the page references, in that order 44ms

[Killed] Regex
acceptance/inspection.ts:4:24
 const SCRIPT_SRC = /<script\b[^>]*\bsrc\s*=\s*("[^"]*"|'[^']*')[^>]*>/gi
 const LINK_TAG = /<link\b[^>]*>/gi
 const HREF_ATTRIBUTE = /\bhref\s*=\s*("[^"]*"|'[^']*')/i
-const STYLESHEET_REL = /\brel\s*=\s*("stylesheet"|'stylesheet'|stylesheet\b)/i
+const STYLESHEET_REL = /\brel\S*=\s*("stylesheet"|'stylesheet'|stylesheet\b)/i
 // The patch digits are matched but never read, so shortening the final
 // quantifier cannot change an answer this module gives. That makes Stryker's
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 1 failed) 62ms

   ❯ reading asset references out of markup (8)
     × a rel attribute surrounded by whitespace still marks a stylesheet 40ms

[Killed] UnaryOperator
acceptance/inspection.ts:12:68
 // Stryker disable next-line Regex
 const VERSION_BANNER = /\b(\d+)\.\d+\.\d+/
 
-const unquoted = (attribute: string): string => attribute.slice(1, -1)
+const unquoted = (attribute: string): string => attribute.slice(1, +1)
 
 export function referencedAssets(html: string): string[] {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y



 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 7 failed) 94ms
   ❯ reading asset references out of markup (8)
     × a script src surrounded by whitespace is still a reference 41ms
     × attributes after the src do not hide it 2ms

[Killed] MethodExpression
acceptance/inspection.ts:12:49
 // Stryker disable next-line Regex
 const VERSION_BANNER = /\b(\d+)\.\d+\.\d+/
 
-const unquoted = (attribute: string): string => attribute.slice(1, -1)
+const unquoted = (attribute: string): string => attribute
 
 export function referencedAssets(html: string): string[] {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 7 failed) 64ms

   ❯ reading asset references out of markup (8)
     × a script src surrounded by whitespace is still a reference 34ms
     × attributes after the src do not hide it 1ms

[Killed] MethodExpression
acceptance/inspection.ts:16:23
 
 export function referencedAssets(html: string): string[] {
   const scripts = [...html.matchAll(SCRIPT_SRC)].map((match) => unquoted(match[1]))
-  const stylesheets = [...html.matchAll(LINK_TAG)]
-    .filter((link) => STYLESHEET_REL.test(link[0]))
+  const stylesheets = [...html.matchAll(LINK_TAG)]
     .map((link) => HREF_ATTRIBUTE.exec(link[0]))
     .filter((href): href is RegExpExecArray => href !== null)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| property/inspection.property.ts (6 tests | 1 failed) 360ms
   ❯ referencedAssets (3)
     × ignores links that are not stylesheets 56ms

 ❯ |mutation| acceptance/inspection.spec.ts (10 tests | 1 failed) 30ms

[Killed] ArrowFunction
acceptance/inspection.ts:17:13
 export function referencedAssets(html: string): string[] {
   const scripts = [...html.matchAll(SCRIPT_SRC)].map((match) => unquoted(match[1]))
   const stylesheets = [...html.matchAll(LINK_TAG)]
-    .filter((link) => STYLESHEET_REL.test(link[0]))
+    .filter(() => undefined)
     .map((link) => HREF_ATTRIBUTE.exec(link[0]))
     .filter((href): href is RegExpExecArray => href !== null)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y



 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 5 failed) 27ms

   ❯ reading asset references out of markup (8)
     × a stylesheet href surrounded by whitespace is still a reference 6ms

[Killed] ConditionalExpression
acceptance/inspection.ts:19:48
   const stylesheets = [...html.matchAll(LINK_TAG)]
     .filter((link) => STYLESHEET_REL.test(link[0]))
     .map((link) => HREF_ATTRIBUTE.exec(link[0]))
-    .filter((href): href is RegExpExecArray => href !== null)
+    .filter((href): href is RegExpExecArray => true)
     .map((href) => unquoted(href[1]))
   return [...scripts, ...stylesheets]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 2 failed) 49ms

   ❯ reading asset references out of markup (8)
     × a stylesheet link with no href is skipped rather than reported as a reference 18ms
     × a page whose only stylesheet link has no href references nothing 1ms

[Killed] EqualityOperator
acceptance/inspection.ts:19:48
   const stylesheets = [...html.matchAll(LINK_TAG)]
     .filter((link) => STYLESHEET_REL.test(link[0]))
     .map((link) => HREF_ATTRIBUTE.exec(link[0]))
-    .filter((href): href is RegExpExecArray => href !== null)
+    .filter((href): href is RegExpExecArray => href === null)
     .map((href) => unquoted(href[1]))
   return [...scripts, ...stylesheets]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y



 ❯ |mutation| acceptance/inspection.spec.ts (10 tests | 1 failed) 77ms

   ❯ referencedAssets (5)
     × finds script sources and stylesheet hrefs 59ms

[Killed] MethodExpression
acceptance/inspection.ts:27:55
 export function compilerMajorVersion(versionOutput: string): number {
   const banner = VERSION_BANNER.exec(versionOutput)
   if (!banner) {
-    throw new Error(`no compiler version in output: ${versionOutput.trim()}`)
+    throw new Error(`no compiler version in output: ${versionOutput}`)
   }
   return Number(banner[1])
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-o7A25Y


 ❯ |mutation| hardening/inspection.hardening.ts (9 tests | 1 failed) 122ms
   ❯ reading the compiler version banner (1)
     × the failure quotes the output without its surrounding whitespace 66ms
