[Killed] StringLiteral
acceptance/layout.ts:6:29
 export const FEATURES_DIR = 'features'
 export const IR_DIR = 'build/acceptance/ir'
 export const GENERATED_DIR = 'build/acceptance/generated'
-export const METADATA_DIR = 'metadata'
+export const METADATA_DIR = ""
 export const FEATURE_EXTENSION = '.feature'
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-34pKOY



 ❯ |mutation| acceptance/generator.spec.ts (20 tests | 1 failed) 64ms

   ❯ featureArtifacts (5)
     × names both artifacts after the IR file 11ms

[Killed] StringLiteral
acceptance/layout.ts:7:34
 export const IR_DIR = 'build/acceptance/ir'
 export const GENERATED_DIR = 'build/acceptance/generated'
 export const METADATA_DIR = 'metadata'
-export const FEATURE_EXTENSION = '.feature'
+export const FEATURE_EXTENSION = ""
 
 const IR_EXTENSION = '.json'
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-34pKOY



 ❯ |mutation| hardening/layout.hardening.ts (11 tests | 1 failed) 21ms

   ❯ where the acceptance pipeline keeps its files (7)
     × feature files carry the .feature extension 5ms

[Killed] StringLiteral
acceptance/layout.ts:16:38
 // it needs its own copies of everything the normal run has. They live under one
 // work directory the mutator owns and `.gitignore` covers.
 export const MUTATION_WORK_DIR = 'build/acceptance-mutation'
-export const MUTATION_FEATURES_DIR = `${MUTATION_WORK_DIR}/features`
+export const MUTATION_FEATURES_DIR = ``
 export const MUTATION_IR_DIR = `${MUTATION_WORK_DIR}/ir`
 export const MUTATION_GENERATED_DIR = `${MUTATION_WORK_DIR}/generated`
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-34pKOY


 ❯ |mutation| hardening/layout.hardening.ts (11 tests | 1 failed) 45ms
   ❯ where acceptance mutation keeps its files (4)
     × staged features, IR and generated tests each get their own directory 31ms

[Killed] StringLiteral
acceptance/layout.ts:20:55
 export const MUTATION_IR_DIR = `${MUTATION_WORK_DIR}/ir`
 export const MUTATION_GENERATED_DIR = `${MUTATION_WORK_DIR}/generated`
 
-const entrypointGlob = (directory: string): string => `${directory}/*${ENTRYPOINT_EXTENSION}`
+const entrypointGlob = (directory: string): string => ``
 
 export const generatedEntrypointGlob = entrypointGlob(GENERATED_DIR)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-34pKOY



 ❯ |mutation| hardening/layout.hardening.ts (11 tests | 2 failed) 26ms

   ❯ where the acceptance pipeline keeps its files (7)

[Killed] StringLiteral
acceptance/layout.ts:26:10
 export const mutationEntrypointGlob = entrypointGlob(MUTATION_GENERATED_DIR)
 
 export function irFileName(featureFile: string): string {
-  return `${basename(featureFile, FEATURE_EXTENSION)}${IR_EXTENSION}`
+  return ``
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-34pKOY


 ❯ |mutation| property/generator.property.ts (15 tests | 2 failed) 506ms

   ❯ the feature to IR round trip (2)
     × recovers the feature path the parse step started from 35ms
     × names the entry point after the same feature 17ms

[Killed] StringLiteral
acceptance/layout.ts:37:10
 }
 
 export function entrypointFileName(irPath: string): string {
-  return `${basename(irPath, IR_EXTENSION)}${ENTRYPOINT_EXTENSION}`
+  return ``
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-34pKOY



 ❯ |mutation| acceptance/layout.spec.ts (4 tests | 1 failed) 10ms
   ❯ entrypointFileName (1)

     × names the entry point after the IR 5ms
