[Killed] Regex
acceptance/mutation-jobs.ts:23:18
   failure?: string
 }
 
-const DURATION = /^(\d+(?:\.\d+)?)(ms|s|m)$/
+const DURATION = /(\d+(?:\.\d+)?)(ms|s|m)$/
 const SCALE = { ms: 1, s: 1_000, m: 60_000 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg



 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 1 failed) 29ms

   ❯ the timeout a job asks for (10)

[Killed] ArithmeticOperator
acceptance/mutation-jobs.ts:31:10
   if (!parsed) {
     return undefined
   }
-  return Number(parsed[1]) * SCALE[parsed[2] as keyof typeof SCALE]
+  return Number(parsed[1]) / SCALE[parsed[2] as keyof typeof SCALE]
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 4 failed) 66ms

   ❯ the timeout a job asks for (10)
     × seconds are milliseconds 33ms
     × minutes are sixty seconds 1ms

[Killed] EqualityOperator
acceptance/mutation-jobs.ts:38:43
 // reporting it as `test_success` would record a mutant as survived on the
 // strength of a test run that did not happen.
 export function classify(completion: Completion): { outcome: Outcome; output: string; error: string } {
-  if (completion.failure !== undefined || completion.exitCode === null) {
+  if (completion.failure !== undefined || completion.exitCode !== null) {
     return {
       outcome: 'infrastructure_error',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 4 failed) 68ms

   ❯ classifying a finished test run (6)
     × a passing run is a surviving mutation 26ms
     × a failing run is a killed mutation 1ms

[Killed] ConditionalExpression
acceptance/mutation-jobs.ts:38:7
 // reporting it as `test_success` would record a mutant as survived on the
 // strength of a test run that did not happen.
 export function classify(completion: Completion): { outcome: Outcome; output: string; error: string } {
-  if (completion.failure !== undefined || completion.exitCode === null) {
+  if (true) {
     return {
       outcome: 'infrastructure_error',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 3 failed) 68ms

   ❯ classifying a finished test run (6)

     × a passing run is a surviving mutation 40ms

[Killed] StringLiteral
acceptance/mutation-jobs.ts:42:36
     return {
       outcome: 'infrastructure_error',
       output: completion.output,
-      error: completion.failure ?? 'the test run was terminated before it reported',
+      error: completion.failure ?? "",
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 1 failed) 63ms

   ❯ classifying a finished test run (6)
     × a run killed without an exit code is an error, not a survivor 27ms

[Killed] ConditionalExpression
acceptance/mutation-jobs.ts:46:14
     }
   }
   return {
-    outcome: completion.exitCode === 0 ? 'test_success' : 'test_failure',
+    outcome: false ? 'test_success' : 'test_failure',
     output: completion.output,
     error: '',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 1 failed) 74ms
   ❯ classifying a finished test run (6)
     × a passing run is a surviving mutation 53ms

[Killed] ConditionalExpression
acceptance/mutation-jobs.ts:46:14
     }
   }
   return {
-    outcome: completion.exitCode === 0 ? 'test_success' : 'test_failure',
+    outcome: true ? 'test_success' : 'test_failure',
     output: completion.output,
     error: '',
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 2 failed) 37ms

   ❯ classifying a finished test run (6)

     × a failing run is a killed mutation 22ms

[Killed] ObjectLiteral
acceptance/mutation-jobs.ts:57:28
   result: { outcome: Outcome; output: string; error: string },
   durationNanoseconds: number,
 ): string {
-  return `${JSON.stringify({
-    id,
-    outcome: result.outcome,
-    output: result.output,
-    error: result.error,
-    duration: durationNanoseconds,
-  })}\n`
+  return `${JSON.stringify({})}\n`
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Khchrg


 ❯ |mutation| hardening/mutation-jobs.hardening.ts (19 tests | 2 failed) 65ms
   ❯ the response the mutator reads back (3)
     × carries the job id, the outcome, the output, the error and the duration 24ms
     × escapes test output that spans lines rather than breaking the protocol 7ms
