[Killed] Regex
acceptance/runtime.ts:30:21
   run: (world: TWorld, args: string[]) => void | Promise<void>
 }
 
-const PLACEHOLDER = /^<([A-Za-z0-9_]+)>$/
+const PLACEHOLDER = /<([A-Za-z0-9_]+)>$/
 
 export function expandScenarios(feature: Feature): ScenarioExecution[] {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 30ms

   ❯ a capture is a placeholder only when it is nothing else (3)
     × text before the opening angle bracket makes it a literal 9ms
     × two placeholders in one capture are a literal, not a substitution 1ms

[Killed] Regex
acceptance/runtime.ts:30:21
   run: (world: TWorld, args: string[]) => void | Promise<void>
 }
 
-const PLACEHOLDER = /^<([A-Za-z0-9_]+)>$/
+const PLACEHOLDER = /^<([^A-Za-z0-9_]+)>$/
 
 export function expandScenarios(feature: Feature): ScenarioExecution[] {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 50ms

   ❯ the error for a placeholder with no example value (2)
     × lists the names the example does have, comma-separated 22ms

[Killed] ArrayDeclaration
acceptance/runtime.ts:35:70
 export function expandScenarios(feature: Feature): ScenarioExecution[] {
   const background = feature.background ?? []
   return feature.scenarios.flatMap((scenario) => {
-    const examples = scenario.examples?.length ? scenario.examples : [{}]
+    const examples = scenario.examples?.length ? scenario.examples : []
     return examples.map((example, index) => ({
       name: `${scenario.name}/example_${index + 1}`,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 29ms

   ❯ a feature without a background (2)
     × contributes no steps of its own to the execution 16ms

[Killed] ArithmeticOperator
acceptance/runtime.ts:37:41
   return feature.scenarios.flatMap((scenario) => {
     const examples = scenario.examples?.length ? scenario.examples : [{}]
     return examples.map((example, index) => ({
-      name: `${scenario.name}/example_${index + 1}`,
+      name: `${scenario.name}/example_${index - 1}`,
       steps: [...background, ...scenario.steps],
       example,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 3 failed) 47ms

   ❯ expandScenarios (4)
     × creates one execution per example row, named one-based 19ms
     × runs a scenario without examples once with an empty example object 3ms

[Killed] StringLiteral
acceptance/runtime.ts:37:13
   return feature.scenarios.flatMap((scenario) => {
     const examples = scenario.examples?.length ? scenario.examples : [{}]
     return examples.map((example, index) => ({
-      name: `${scenario.name}/example_${index + 1}`,
+      name: ``,
       steps: [...background, ...scenario.steps],
       example,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 3 failed) 81ms

   ❯ expandScenarios (4)

     × creates one execution per example row, named one-based 38ms

[Killed] ConditionalExpression
acceptance/runtime.ts:51:7
   }
   const name = placeholder[1]
   const value = example[name]
-  if (value === undefined) {
+  if (true) {
     throw new Error(`no example value for <${name}>; available: ${Object.keys(example).join(', ') || 'none'}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 4 failed) 63ms

   ❯ resolveArgument (5)
     × reads a placeholder capture from the example object 15ms
     × substitutes once and does not rescan the substituted value 1ms

[Killed] BlockStatement
acceptance/runtime.ts:51:28
   }
   const name = placeholder[1]
   const value = example[name]
-  if (value === undefined) {
-    throw new Error(`no example value for <${name}>; available: ${Object.keys(example).join(', ') || 'none'}`)
-  }
+  if (value === undefined) {}
   return value
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 1 failed) 88ms

   ❯ resolveArgument (5)

[Killed] ConditionalExpression
acceptance/runtime.ts:52:67
   const name = placeholder[1]
   const value = example[name]
   if (value === undefined) {
-    throw new Error(`no example value for <${name}>; available: ${Object.keys(example).join(', ') || 'none'}`)
+    throw new Error(`no example value for <${name}>; available: ${true}`)
   }
   return value
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 46ms

   ❯ the error for a placeholder with no example value (2)
     × lists the names the example does have, comma-separated 13ms
     × says "none" when the example carries no names at all 11ms

[Killed] ConditionalExpression
acceptance/runtime.ts:52:67
   const name = placeholder[1]
   const value = example[name]
   if (value === undefined) {
-    throw new Error(`no example value for <${name}>; available: ${Object.keys(example).join(', ') || 'none'}`)
+    throw new Error(`no example value for <${name}>; available: ${false}`)
   }
   return value
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 41ms
   ❯ the error for a placeholder with no example value (2)
     × lists the names the example does have, comma-separated 28ms
     × says "none" when the example carries no names at all 1ms

[Killed] MethodExpression
acceptance/runtime.ts:63:42
 ): { handler: StepHandler<TWorld>; captures: string[] } {
   const matches = handlers.flatMap((handler) => {
     const match = handler.pattern.exec(text)
-    return match ? [{ handler, captures: match.slice(1) }] : []
+    return match ? [{ handler, captures: match }] : []
   })
   if (matches.length === 0) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| property/runtime.property.ts (11 tests | 1 failed) 422ms

   ❯ runExecution (1)
     × runs every step once, in order, with its arguments resolved 40ms

[Killed] ConditionalExpression
acceptance/runtime.ts:65:7
     const match = handler.pattern.exec(text)
     return match ? [{ handler, captures: match.slice(1) }] : []
   })
-  if (matches.length === 0) {
+  if (false) {
     throw new Error(`unsupported step text: "${text}"`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| property/runtime.property.ts (11 tests | 1 failed) 424ms
   ❯ matchStep (3)
     × refuses step text no handler claims 23ms

 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 1 failed) 68ms

[Killed] BlockStatement
acceptance/runtime.ts:65:29
     const match = handler.pattern.exec(text)
     return match ? [{ handler, captures: match.slice(1) }] : []
   })
-  if (matches.length === 0) {
-    throw new Error(`unsupported step text: "${text}"`)
-  }
+  if (matches.length === 0) {}
   if (matches.length > 1) {
     throw new Error(`ambiguous step text: "${text}" matches ${matches.length} handlers`)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 1 failed) 97ms

   ❯ matchStep (3)

[Killed] BlockStatement
acceptance/runtime.ts:68:27
   if (matches.length === 0) {
     throw new Error(`unsupported step text: "${text}"`)
   }
-  if (matches.length > 1) {
-    throw new Error(`ambiguous step text: "${text}" matches ${matches.length} handlers`)
-  }
+  if (matches.length > 1) {}
   return matches[0]
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 1 failed) 64ms
   ❯ matchStep (3)
     × fails on ambiguous step text rather than picking one handler 16ms

[Killed] BlockStatement
acceptance/runtime.ts:78:18
   execution: ScenarioExecution,
   handlers: StepHandler<TWorld>[],
   world: TWorld,
-): Promise<void> {
-  for (const step of execution.steps) {
-    const { handler, captures } = matchStep(step.text, handlers)
-    const args = captures.map((capture) => resolveArgument(capture, execution.example))
-    try {
-      await handler.run(world, args)
-    } catch (cause) {
-      throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, { cause })
-    }
-  }
-}
+): Promise<void> {}
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 58ms
   ❯ a step that fails (2)
     × reports the step that failed and what it said 34ms
     × keeps the original failure as the cause, so the stack is not lost 1ms

[Killed] BlockStatement
acceptance/runtime.ts:79:39
   handlers: StepHandler<TWorld>[],
   world: TWorld,
 ): Promise<void> {
-  for (const step of execution.steps) {
-    const { handler, captures } = matchStep(step.text, handlers)
-    const args = captures.map((capture) => resolveArgument(capture, execution.example))
-    try {
-      await handler.run(world, args)
-    } catch (cause) {
-      throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, { cause })
-    }
-  }
+  for (const step of execution.steps) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 3 failed) 88ms
   ❯ runExecution (3)
     × runs steps in order against one shared world, with resolved arguments 25ms
     × reports which step failed 22ms
     × awaits asynchronous handlers before moving on 1ms

[Killed] BlockStatement
acceptance/runtime.ts:82:9
   for (const step of execution.steps) {
     const { handler, captures } = matchStep(step.text, handlers)
     const args = captures.map((capture) => resolveArgument(capture, execution.example))
-    try {
-      await handler.run(world, args)
-    } catch (cause) {
+    try {} catch (cause) {
       throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, { cause })
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| acceptance/runtime.spec.ts (15 tests | 3 failed) 42ms
   ❯ runExecution (3)
     × runs steps in order against one shared world, with resolved arguments 14ms
     × reports which step failed 3ms
     × awaits asynchronous handlers before moving on 1ms

[Killed] BlockStatement
acceptance/runtime.ts:84:21
     const args = captures.map((capture) => resolveArgument(capture, execution.example))
     try {
       await handler.run(world, args)
-    } catch (cause) {
-      throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, { cause })
-    }
+    } catch (cause) {}
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk


 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 78ms

   ❯ a step that fails (2)
     × reports the step that failed and what it said 35ms
     × keeps the original failure as the cause, so the stack is not lost 12ms

[Killed] CallExpression
acceptance/runtime.ts:85:7
     try {
       await handler.run(world, args)
     } catch (cause) {
-      throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, { cause })
+      ;
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 2 failed) 52ms

   ❯ a step that fails (2)
     × reports the step that failed and what it said 18ms

[Killed] ObjectLiteral
acceptance/runtime.ts:85:84
     try {
       await handler.run(world, args)
     } catch (cause) {
-      throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, { cause })
+      throw new Error(`${step.keyword} ${step.text}\n${(cause as Error).message}`, {})
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-BGzfkk



 ❯ |mutation| hardening/runtime.hardening.ts (9 tests | 1 failed) 40ms

   ❯ a step that fails (2)
