[Killed] MethodExpression
scripts/architecture/layering.ts:17:3
 }
 
 const packageMember = (specifier: string): string | undefined =>
-  specifier.startsWith('./') ? specifier.slice(2) : undefined
+  specifier.endsWith('./') ? specifier.slice(2) : undefined
 
 const leavesPackage = (specifier: string): boolean =>
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| property/layering.property.ts (10 tests | 4 failed) 305ms

   ❯ layerViolations (7)
     × reports nothing when every import runs shell -> core 52ms

[Killed] MethodExpression
scripts/architecture/layering.ts:17:32
 }
 
 const packageMember = (specifier: string): string | undefined =>
-  specifier.startsWith('./') ? specifier.slice(2) : undefined
+  specifier.startsWith('./') ? specifier : undefined
 
 const leavesPackage = (specifier: string): boolean =>
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 5 failed) 83ms
   ❯ layerViolations (9)
     × passes a shell module importing a core module 34ms
     × reports a core module importing a shell module 2ms
     × reports an import of a module the layer map does not know 2ms

[Killed] EqualityOperator
scripts/architecture/layering.ts:20:32
   specifier.startsWith('./') ? specifier.slice(2) : undefined
 
 const leavesPackage = (specifier: string): boolean =>
-  specifier.startsWith('.') && packageMember(specifier) === undefined
+  specifier.startsWith('.') && packageMember(specifier) !== undefined
 
 const memberFault = (module: string, member: string, rules: LayerRules): string | undefined => {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 4 failed) 36ms
   ❯ layerViolations (9)
     × passes a shell module importing a core module 17ms
     × reports a core module importing a shell module 6ms
     × reports an import that reaches outside the package 1ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:20:3
   specifier.startsWith('./') ? specifier.slice(2) : undefined
 
 const leavesPackage = (specifier: string): boolean =>
-  specifier.startsWith('.') && packageMember(specifier) === undefined
+  true
 
 const memberFault = (module: string, member: string, rules: LayerRules): string | undefined => {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 6 failed) 86ms

   ❯ layerViolations (9)
     × passes a shell module importing a core module 44ms
     × reports a core module importing a shell module 5ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:24:7
 
 const memberFault = (module: string, member: string, rules: LayerRules): string | undefined => {
   const layer = rules.layers[member]
-  if (!layer) {
+  if (false) {
     return `${module} imports ${member}, which the layer map does not declare`
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 23ms

   ❯ layerViolations (9)
     × reports an import of a module the layer map does not know 7ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:24:7
 
 const memberFault = (module: string, member: string, rules: LayerRules): string | undefined => {
   const layer = rules.layers[member]
-  if (!layer) {
+  if (true) {
     return `${module} imports ${member}, which the layer map does not declare`
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 3 failed) 41ms
   ❯ layerViolations (9)
     × passes a shell module importing a core module 18ms
     × reports a core module importing a shell module 5ms

[Killed] EqualityOperator
scripts/architecture/layering.ts:27:7
   if (!layer) {
     return `${module} imports ${member}, which the layer map does not declare`
   }
-  if (rules.layers[module] === 'core' && layer === 'shell') {
+  if (rules.layers[module] !== 'core' && layer === 'shell') {
     return `core module ${module} imports shell module ${member}`
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| property/layering.property.ts (10 tests | 2 failed) 411ms
   ❯ layerViolations (7)
     × reports nothing when every import runs shell -> core 95ms
     × reports every core module that imports a shell module 11ms

[Killed] EqualityOperator
scripts/architecture/layering.ts:27:42
   if (!layer) {
     return `${module} imports ${member}, which the layer map does not declare`
   }
-  if (rules.layers[module] === 'core' && layer === 'shell') {
+  if (rules.layers[module] === 'core' && layer !== 'shell') {
     return `core module ${module} imports shell module ${member}`
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 46ms
   ❯ layerViolations (9)
     × reports a core module importing a shell module 23ms

[Killed] EqualityOperator
scripts/architecture/layering.ts:34:7
 }
 
 const externalFault = (module: string, specifier: string, rules: LayerRules): string | undefined => {
-  if (rules.layers[module] !== 'core' || rules.pureExternals.includes(specifier)) {
+  if (rules.layers[module] === 'core' || rules.pureExternals.includes(specifier)) {
     return undefined
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 73ms

   ❯ layerViolations (9)
     × lets a shell module import anything from outside 21ms
     × reports a core module importing a dependency that is not pure 10ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:34:7
 }
 
 const externalFault = (module: string, specifier: string, rules: LayerRules): string | undefined => {
-  if (rules.layers[module] !== 'core' || rules.pureExternals.includes(specifier)) {
+  if (true) {
     return undefined
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 51ms
   ❯ layerViolations (9)
     × reports a core module importing a dependency that is not pure 18ms

[Killed] BlockStatement
scripts/architecture/layering.ts:41:33
 }
 
 const importFault = (module: string, specifier: string, rules: LayerRules): string | undefined => {
-  if (leavesPackage(specifier)) {
-    return `${module} imports ${specifier}, which leaves the package`
-  }
+  if (leavesPackage(specifier)) {}
   const member = packageMember(specifier)
   return member ? memberFault(module, member, rules) : externalFault(module, specifier, rules)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 67ms

   ❯ layerViolations (9)
     × reports an import that reaches outside the package 28ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:41:7
 }
 
 const importFault = (module: string, specifier: string, rules: LayerRules): string | undefined => {
-  if (leavesPackage(specifier)) {
+  if (false) {
     return `${module} imports ${specifier}, which leaves the package`
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 45ms
   ❯ layerViolations (9)
     × reports an import that reaches outside the package 16ms

[Killed] ArrayDeclaration
scripts/architecture/layering.ts:50:10
 
 const classificationFaults = (modules: ModuleImports[], rules: LayerRules): string[] => {
   const present = new Set(modules.map((entry) => entry.module))
-  return [
-    ...modules
-      .filter((entry) => !(entry.module in rules.layers))
-      .map((entry) => `${entry.module} is not declared in the layer map`),
-    ...Object.keys(rules.layers)
-      .filter((module) => !present.has(module))
-      .map((module) => `the layer map declares ${module}, which does not exist`),
-  ]
+  return []
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 40ms

   ❯ layerViolations (9)
     × reports a module the layer map does not classify 20ms

[Killed] MethodExpression
scripts/architecture/layering.ts:51:8
 const classificationFaults = (modules: ModuleImports[], rules: LayerRules): string[] => {
   const present = new Set(modules.map((entry) => entry.module))
   return [
-    ...modules
-      .filter((entry) => !(entry.module in rules.layers))
+    ...modules
       .map((entry) => `${entry.module} is not declared in the layer map`),
     ...Object.keys(rules.layers)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 9 failed) 93ms

   ❯ layerViolations (9)

     × passes a shell module importing a core module 34ms

[Killed] BooleanLiteral
scripts/architecture/layering.ts:52:26
   const present = new Set(modules.map((entry) => entry.module))
   return [
     ...modules
-      .filter((entry) => !(entry.module in rules.layers))
+      .filter((entry) => entry.module in rules.layers)
       .map((entry) => `${entry.module} is not declared in the layer map`),
     ...Object.keys(rules.layers)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 9 failed) 52ms

   ❯ layerViolations (9)
     × passes a shell module importing a core module 20ms
     × reports a core module importing a shell module 11ms

[Killed] ArrowFunction
scripts/architecture/layering.ts:52:15
   const present = new Set(modules.map((entry) => entry.module))
   return [
     ...modules
-      .filter((entry) => !(entry.module in rules.layers))
+      .filter(() => undefined)
       .map((entry) => `${entry.module} is not declared in the layer map`),
     ...Object.keys(rules.layers)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 39ms

   ❯ layerViolations (9)

     × reports a module the layer map does not classify 23ms

[Killed] MethodExpression
scripts/architecture/layering.ts:54:8
     ...modules
       .filter((entry) => !(entry.module in rules.layers))
       .map((entry) => `${entry.module} is not declared in the layer map`),
-    ...Object.keys(rules.layers)
-      .filter((module) => !present.has(module))
+    ...Object.keys(rules.layers)
       .map((module) => `the layer map declares ${module}, which does not exist`),
   ]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 9 failed) 56ms

   ❯ layerViolations (9)
     × passes a shell module importing a core module 29ms
     × reports a core module importing a shell module 1ms

[Killed] BooleanLiteral
scripts/architecture/layering.ts:55:27
       .filter((entry) => !(entry.module in rules.layers))
       .map((entry) => `${entry.module} is not declared in the layer map`),
     ...Object.keys(rules.layers)
-      .filter((module) => !present.has(module))
+      .filter((module) => present.has(module))
       .map((module) => `the layer map declares ${module}, which does not exist`),
   ]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 9 failed) 95ms

   ❯ layerViolations (9)

     × passes a shell module importing a core module 40ms

[Killed] ArrowFunction
scripts/architecture/layering.ts:55:15
       .filter((entry) => !(entry.module in rules.layers))
       .map((entry) => `${entry.module} is not declared in the layer map`),
     ...Object.keys(rules.layers)
-      .filter((module) => !present.has(module))
+      .filter(() => undefined)
       .map((module) => `the layer map declares ${module}, which does not exist`),
   ]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 1 failed) 42ms

   ❯ layerViolations (9)

     × reports a classified module that no longer exists 25ms

[Killed] EqualityOperator
scripts/architecture/layering.ts:75:75
     // in would put a specifier that is not a module into the walk, where it has
     // no edges of its own and so can never close a cycle - the same answer, by
     // a longer route. Dropping them is a type obligation, not a decision.
-    entry.imports.map(packageMember).filter((member): member is string => member !== undefined),
+    entry.imports.map(packageMember).filter((member): member is string => member === undefined),
   ]))
   const cycles: string[] = []
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 43ms
   ❯ importCycles (4)
     × names the modules a cycle runs through 14ms
     × finds a cycle that runs through three modules 1ms

[Killed] ArrayDeclaration
scripts/architecture/layering.ts:77:28
     // a longer route. Dropping them is a type obligation, not a decision.
     entry.imports.map(packageMember).filter((member): member is string => member !== undefined),
   ]))
-  const cycles: string[] = []
+  const cycles: string[] = ["Stryker was here"]
   const finished = new Set<string>()
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 4 failed) 58ms

   ❯ importCycles (4)
     × finds nothing in an acyclic graph 24ms
     × names the modules a cycle runs through 12ms

[Killed] BlockStatement
scripts/architecture/layering.ts:80:58
   const cycles: string[] = []
   const finished = new Set<string>()
 
-  const walk = (module: string, path: string[]): void => {
-    if (path.includes(module)) {
-      cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
-      return
-    }
-    if (finished.has(module)) {
-      return
-    }
-    for (const next of edges.get(module) ?? []) {
-      walk(next, [...path, module])
-    }
-    finished.add(module)
-  }
+  const walk = (module: string, path: string[]): void => {}
 
   for (const entry of modules) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 79ms

   ❯ importCycles (4)
     × names the modules a cycle runs through 48ms
     × finds a cycle that runs through three modules 1ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:81:9
   const finished = new Set<string>()
 
   const walk = (module: string, path: string[]): void => {
-    if (path.includes(module)) {
+    if (true) {
       cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
       return
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 4 failed) 55ms

   ❯ importCycles (4)
     × finds nothing in an acyclic graph 11ms
     × names the modules a cycle runs through 6ms

[Killed] BlockStatement
scripts/architecture/layering.ts:81:32
   const finished = new Set<string>()
 
   const walk = (module: string, path: string[]): void => {
-    if (path.includes(module)) {
-      cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
-      return
-    }
+    if (path.includes(module)) {}
     if (finished.has(module)) {
       return
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 1326ms

   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 1322ms

[Killed] MethodExpression
scripts/architecture/layering.ts:82:23
 
   const walk = (module: string, path: string[]): void => {
     if (path.includes(module)) {
-      cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
+      cycles.push([...path, module].join(' -> '))
       return
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 19ms

   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 14ms

[Killed] StringLiteral
scripts/architecture/layering.ts:82:70
 
   const walk = (module: string, path: string[]): void => {
     if (path.includes(module)) {
-      cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
+      cycles.push([...path.slice(path.indexOf(module)), module].join(""))
       return
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 45ms

   ❯ importCycles (4)
     × names the modules a cycle runs through 23ms
     × finds a cycle that runs through three modules 1ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:85:9
       cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
       return
     }
-    if (finished.has(module)) {
+    if (true) {
       return
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 56ms
   ❯ importCycles (4)
     × names the modules a cycle runs through 31ms
     × finds a cycle that runs through three modules 1ms

[Killed] ConditionalExpression
scripts/architecture/layering.ts:85:9
       cycles.push([...path.slice(path.indexOf(module)), module].join(' -> '))
       return
     }
-    if (finished.has(module)) {
+    if (false) {
       return
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 38ms

   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 25ms

[Killed] BlockStatement
scripts/architecture/layering.ts:88:49
     if (finished.has(module)) {
       return
     }
-    for (const next of edges.get(module) ?? []) {
-      walk(next, [...path, module])
-    }
+    for (const next of edges.get(module) ?? []) {}
     finished.add(module)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 29ms
   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 27ms

 ❯ |mutation| scripts/architecture/layering.spec.ts (13 tests | 2 failed) 55ms

[Killed] ArrayDeclaration
scripts/architecture/layering.ts:89:18
       return
     }
     for (const next of edges.get(module) ?? []) {
-      walk(next, [...path, module])
+      walk(next, [])
     }
     finished.add(module)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 49ms

   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 37ms

[Killed] CallExpression
scripts/architecture/layering.ts:91:5
     for (const next of edges.get(module) ?? []) {
       walk(next, [...path, module])
     }
-    finished.add(module)
+    ;
   }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 37ms

   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 35ms

[Killed] BlockStatement
scripts/architecture/layering.ts:94:32
     finished.add(module)
   }
 
-  for (const entry of modules) {
-    // Stryker disable next-line ArrayDeclaration: a cycle is reported from the
-    // first repeated module onwards, so seeding the path with anything that is
-    // not a module name gives the same answer.
-    walk(entry.module, [])
-  }
+  for (const entry of modules) {}
   return cycles
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw


 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 19ms

   ❯ reporting an import cycle (3)
     × names only the modules the cycle runs through, not the way in 17ms

[Killed] CallExpression
scripts/architecture/layering.ts:98:5
     // Stryker disable next-line ArrayDeclaration: a cycle is reported from the
     // first repeated module onwards, so seeding the path with anything that is
     // not a module name gives the same answer.
-    walk(entry.module, [])
+    ;
   }
   return cycles
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-c1lktw



 ❯ |mutation| hardening/layering.hardening.ts (3 tests | 1 failed) 29ms

   ❯ reporting an import cycle (3)
