[Killed] StringLiteral
scripts/architecture/packages.ts:37:19
     'project-files.ts': 'shell',
     'steps.ts': 'shell',
   },
-  pureExternals: ['node:crypto', 'node:path'],
+  pureExternals: ["", 'node:path'],
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-3j9E4G


 ❯ |mutation| hardening/packages.hardening.ts (8 tests | 1 failed) 63ms

   ❯ the pure dependencies a package grants (3)
     × acceptance grants exactly what its core modules import 39ms

[Killed] ArrayDeclaration
scripts/architecture/packages.ts:54:18
     'score.ts': 'core',
     'tiers.ts': 'core',
   },
-  pureExternals: ['node:path', 'typescript'],
+  pureExternals: [],
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-3j9E4G


 ❯ |mutation| scripts/architecture/packages.spec.ts (8 tests | 1 failed) 30ms

   ❯ the scripts/crap package (2)
     × keeps every module on the side of the boundary the rules declare 12ms

[Killed] StringLiteral
scripts/architecture/packages.ts:69:16
 
 export const PACKAGES: PackageRules[] = [
   { directory: 'acceptance', rules: acceptanceRules },
-  { directory: 'scripts/crap', rules: crapRules },
+  { directory: "", rules: crapRules },
   { directory: 'scripts/architecture', rules: architectureRules },
 ]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-3j9E4G



 ❯ |mutation| hardening/packages.hardening.ts (8 tests | 2 failed) 81ms

   ❯ what the boundary check governs (1)
     × every tooling module belongs to a declared package or is a declared CLI wrapper 16ms

[Killed] MethodExpression
scripts/architecture/packages.ts:75:3
 
 // Project-relative paths, for the callers that measure or skip a whole layer.
 export const modulesIn = (layer: Layer): string[] => PACKAGES.flatMap(({ directory, rules }) =>
-  Object.entries(rules.layers)
-    .filter(([, declared]) => declared === layer)
+  Object.entries(rules.layers)
     .map(([module]) => `${directory}/${module}`))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-3j9E4G


 ❯ |mutation| hardening/packages.hardening.ts (8 tests | 5 failed) 117ms
   ❯ what a layer answers with (4)
     × the two layers together are every module the packages declare 22ms
     × every module core answers with is declared undefined 1ms
     × every module shell answers with is declared undefined 1ms

[Killed] ConditionalExpression
scripts/architecture/packages.ts:76:31
 // Project-relative paths, for the callers that measure or skip a whole layer.
 export const modulesIn = (layer: Layer): string[] => PACKAGES.flatMap(({ directory, rules }) =>
   Object.entries(rules.layers)
-    .filter(([, declared]) => declared === layer)
+    .filter(([, declared]) => false)
     .map(([module]) => `${directory}/${module}`))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-3j9E4G



 ❯ |mutation| hardening/packages.hardening.ts (8 tests | 4 failed) 42ms
   ❯ what a layer answers with (4)
     × the two layers together are every module the packages declare 24ms
   ❯ what the boundary check governs (1)

[Killed] ConditionalExpression
scripts/architecture/packages.ts:76:31
 // Project-relative paths, for the callers that measure or skip a whole layer.
 export const modulesIn = (layer: Layer): string[] => PACKAGES.flatMap(({ directory, rules }) =>
   Object.entries(rules.layers)
-    .filter(([, declared]) => declared === layer)
+    .filter(([, declared]) => true)
     .map(([module]) => `${directory}/${module}`))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-3j9E4G



 ❯ |mutation| hardening/packages.hardening.ts (8 tests | 5 failed) 196ms

   ❯ what a layer answers with (4)
