[Killed] ConditionalExpression
scripts/crap/complexity.ts:49:3
 ])
 
 const isDecisionPoint = (node: ts.Node): boolean =>
-  DECISION_KINDS.has(node.kind) ||
-  (ts.isBinaryExpression(node) && SHORT_CIRCUIT_OPERATORS.has(node.operatorToken.kind))
+  true
 
 // A function expression is usually named by what it is assigned to rather than
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| property/complexity.property.ts (5 tests | 3 failed) 248ms

   ❯ complexityByFunction (5)
     × charges the module scope one for itself and one per decision outside any function 21ms
     × charges a decision to the function holding it, and leaves the module at one 15ms

[Killed] ConditionalExpression
scripts/crap/complexity.ts:49:3
 ])
 
 const isDecisionPoint = (node: ts.Node): boolean =>
-  DECISION_KINDS.has(node.kind) ||
-  (ts.isBinaryExpression(node) && SHORT_CIRCUIT_OPERATORS.has(node.operatorToken.kind))
+  false
 
 // A function expression is usually named by what it is assigned to rather than
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| property/complexity.property.ts (5 tests | 3 failed) 246ms
   ❯ complexityByFunction (5)

     × charges the module scope one for itself and one per decision outside any function 64ms

[Killed] ConditionalExpression
scripts/crap/complexity.ts:50:4
 
 const isDecisionPoint = (node: ts.Node): boolean =>
   DECISION_KINDS.has(node.kind) ||
-  (ts.isBinaryExpression(node) && SHORT_CIRCUIT_OPERATORS.has(node.operatorToken.kind))
+  (false)
 
 // A function expression is usually named by what it is assigned to rather than
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 10 failed) 66ms
   ❯ complexityByFunction (22)
     × counts && as one decision 6ms
     × counts || as one decision 1ms

[Killed] LogicalOperator
scripts/crap/complexity.ts:57:10
 const namingNode = (node: ts.Node): ts.Node | undefined => {
   const own = (node as { name?: ts.Node }).name
   const holder = node.parent as { name?: ts.Node; left?: ts.Node } | undefined
-  return own ?? holder?.name ?? holder?.left
+  return (own ?? holder?.name) && holder?.left
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| property/complexity.property.ts (5 tests | 4 failed) 195ms

   ❯ complexityByFunction (5)

[Killed] BlockStatement
scripts/crap/complexity.ts:62:71
 
 const functionName = (node: ts.Node): string => {
   const named = namingNode(node)
-  if (named && (ts.isIdentifier(named) || ts.isStringLiteral(named))) {
-    return named.text
-  }
+  if (named && (ts.isIdentifier(named) || ts.isStringLiteral(named))) {}
   // A named class names its own constructor through the clause above, so only
   // a class with no name of its own reaches here.
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 31 failed) 174ms

   ❯ complexityByFunction (22)

     × scores a function with no decision at one 50ms

[Killed] ConditionalExpression
scripts/crap/complexity.ts:67:7
   }
   // A named class names its own constructor through the clause above, so only
   // a class with no name of its own reaches here.
-  if (ts.isConstructorDeclaration(node)) {
+  if (false) {
     return 'class.constructor'
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 1 failed) 177ms
   ❯ the name a function is reported under (11)
     × reports the constructor of a class with no name of its own as class.constructor 10ms

[Killed] BlockStatement
scripts/crap/complexity.ts:67:42
   }
   // A named class names its own constructor through the clause above, so only
   // a class with no name of its own reaches here.
-  if (ts.isConstructorDeclaration(node)) {
-    return 'class.constructor'
-  }
+  if (ts.isConstructorDeclaration(node)) {}
   return '<anonymous>'
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 1 failed) 134ms

   ❯ the name a function is reported under (11)

     × reports the constructor of a class with no name of its own as class.constructor 12ms

[Killed] ArithmeticOperator
scripts/crap/complexity.ts:77:20
   const start = source.getLineAndCharacterOfPosition(node.getStart(source))
   const end = source.getLineAndCharacterOfPosition(node.getEnd())
   return {
-    start: { line: start.line + 1, column: start.character },
+    start: { line: start.line - 1, column: start.character },
     end: { line: end.line + 1, column: end.character },
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 4 failed) 84ms
   ❯ complexityByFunction (22)

     × reports the module scope even for an empty source 15ms

[Killed] ArithmeticOperator
scripts/crap/complexity.ts:78:18
   const end = source.getLineAndCharacterOfPosition(node.getEnd())
   return {
     start: { line: start.line + 1, column: start.character },
-    end: { line: end.line + 1, column: end.character },
+    end: { line: end.line - 1, column: end.character },
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 3 failed) 72ms

   ❯ complexityByFunction (22)
     × reports the module scope even for an empty source 10ms
   ❯ the span a function is reported at (3)

[Killed] BooleanLiteral
scripts/crap/complexity.ts:86:3
   fileName,
   text,
   ts.ScriptTarget.Latest,
-  true,
+  false,
   fileName.endsWith('.tsx') ? ts.ScriptKind.TSX : ts.ScriptKind.TS,
 )
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| property/complexity.property.ts (5 tests | 4 failed) 229ms
   ❯ complexityByFunction (5)
     × charges a decision to the function holding it, and leaves the module at one 26ms
     × charges a callback its own decisions, so the function it is passed to keeps none 9ms
     × never scores anything below

[Killed] MethodExpression
scripts/crap/complexity.ts:87:3
   text,
   ts.ScriptTarget.Latest,
   true,
-  fileName.endsWith('.tsx') ? ts.ScriptKind.TSX : ts.ScriptKind.TS,
+  fileName.startsWith('.tsx') ? ts.ScriptKind.TSX : ts.ScriptKind.TS,
 )
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 1 failed) 218ms

   ❯ parsing (2)
     × reads a .tsx file as TSX, where an element is not a type assertion 31ms

[Killed] StringLiteral
scripts/crap/complexity.ts:87:21
   text,
   ts.ScriptTarget.Latest,
   true,
-  fileName.endsWith('.tsx') ? ts.ScriptKind.TSX : ts.ScriptKind.TS,
+  fileName.endsWith("") ? ts.ScriptKind.TSX : ts.ScriptKind.TS,
 )
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| hardening/complexity.hardening.ts (6 tests | 1 failed) 45ms

   ❯ which parser a file gets, read off its extension (3)

     × a .ts file parses a generic arrow as a function 17ms

[Killed] BlockStatement
scripts/crap/complexity.ts:97:73
   const source = parse(fileName, text)
   const moduleScope = { name: MODULE_SCOPE, span: spanOf(source, source), complexity: 1 }
   const functions = [moduleScope]
-  const visit = (node: ts.Node, enclosing: FunctionComplexity): void => {
-    let scope = enclosing
-    if (FUNCTION_KINDS.has(node.kind)) {
-      scope = { name: functionName(node), span: spanOf(node, source), complexity: 1 }
-      functions.push(scope)
-    }
-    if (isDecisionPoint(node)) {
-      scope.complexity += 1
-    }
-    ts.forEachChild(node, (child) => visit(child, scope))
-  }
+  const visit = (node: ts.Node, enclosing: FunctionComplexity): void => {}
   ts.forEachChild(source, (child) => visit(child, moduleScope))
   return functions
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| hardening/complexity.hardening.ts (6 tests | 3 failed) 68ms
   ❯ what the gate calls code that is in no function (3)
     × the label is not a name a function could be reported under 20ms
   ❯ which parser a file gets, read off its extension (3)

[Killed] BlockStatement
scripts/crap/complexity.ts:99:40
   const functions = [moduleScope]
   const visit = (node: ts.Node, enclosing: FunctionComplexity): void => {
     let scope = enclosing
-    if (FUNCTION_KINDS.has(node.kind)) {
-      scope = { name: functionName(node), span: spanOf(node, source), complexity: 1 }
-      functions.push(scope)
-    }
+    if (FUNCTION_KINDS.has(node.kind)) {}
     if (isDecisionPoint(node)) {
       scope.complexity += 1
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| hardening/complexity.hardening.ts (6 tests | 3 failed) 98ms

   ❯ what the gate calls code that is in no function (3)
     × the label is not a name a function could be reported under 37ms
   ❯ which parser a file gets, read off its extension (3)

[Killed] ConditionalExpression
scripts/crap/complexity.ts:99:9
   const functions = [moduleScope]
   const visit = (node: ts.Node, enclosing: FunctionComplexity): void => {
     let scope = enclosing
-    if (FUNCTION_KINDS.has(node.kind)) {
+    if (false) {
       scope = { name: functionName(node), span: spanOf(node, source), complexity: 1 }
       functions.push(scope)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| hardening/complexity.hardening.ts (6 tests | 3 failed) 79ms

   ❯ what the gate calls code that is in no function (3)
     × the label is not a name a function could be reported under 28ms
   ❯ which parser a file gets, read off its extension (3)

[Killed] CallExpression
scripts/crap/complexity.ts:101:7
     let scope = enclosing
     if (FUNCTION_KINDS.has(node.kind)) {
       scope = { name: functionName(node), span: spanOf(node, source), complexity: 1 }
-      functions.push(scope)
+      ;
     }
     if (isDecisionPoint(node)) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| hardening/complexity.hardening.ts (6 tests | 3 failed) 40ms
   ❯ what the gate calls code that is in no function (3)
     × the label is not a name a function could be reported under 12ms
   ❯ which parser a file gets, read off its extension (3)

[Killed] ConditionalExpression
scripts/crap/complexity.ts:103:9
       scope = { name: functionName(node), span: spanOf(node, source), complexity: 1 }
       functions.push(scope)
     }
-    if (isDecisionPoint(node)) {
+    if (false) {
       scope.complexity += 1
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 22 failed) 163ms
   ❯ complexityByFunction (22)
     × counts if as one decision 10ms
     × counts if/else, which is the same one decision as one decision 6ms
     × counts a conditional expression as one decision 2ms

[Killed] ConditionalExpression
scripts/crap/complexity.ts:103:9
       scope = { name: functionName(node), span: spanOf(node, source), complexity: 1 }
       functions.push(scope)
     }
-    if (isDecisionPoint(node)) {
+    if (true) {
       scope.complexity += 1
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| property/complexity.property.ts (5 tests | 3 failed) 225ms

   ❯ complexityByFunction (5)
     × charges the module scope one for itself and one per decision outside any function 20ms

[Killed] AssignmentOperator
scripts/crap/complexity.ts:104:7
       functions.push(scope)
     }
     if (isDecisionPoint(node)) {
-      scope.complexity += 1
+      scope.complexity -= 1
     }
     ts.forEachChild(node, (child) => visit(child, scope))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa



 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 22 failed) 109ms

   ❯ complexityByFunction (22)

[Killed] ArrowFunction
scripts/crap/complexity.ts:106:27
     if (isDecisionPoint(node)) {
       scope.complexity += 1
     }
-    ts.forEachChild(node, (child) => visit(child, scope))
+    ts.forEachChild(node, () => undefined)
   }
   ts.forEachChild(source, (child) => visit(child, moduleScope))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| scripts/crap/complexity.spec.ts (38 tests | 34 failed) 165ms

   ❯ complexityByFunction (22)

     × counts if as one decision 17ms

[Killed] ArrowFunction
scripts/crap/complexity.ts:108:27
     }
     ts.forEachChild(node, (child) => visit(child, scope))
   }
-  ts.forEachChild(source, (child) => visit(child, moduleScope))
+  ts.forEachChild(source, () => undefined)
   return functions
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-YLUWLa


 ❯ |mutation| property/complexity.property.ts (5 tests | 5 failed) 146ms

   ❯ complexityByFunction (5)

     × charges the module scope one for itself and one per decision outside any function 73ms
