[Killed] BlockStatement
scripts/crap/coverage.ts:42:73
 // never called it.
 export function mergeReports(reports: CoverageReport[]): FileStatements[] {
   const files = new Map<string, Map<string, Statement>>()
-  for (const { filePath, statements } of reports.flatMap(statementsOf)) {
-    const merged = files.get(filePath) ?? new Map<string, Statement>()
-    files.set(filePath, merged)
-    for (const statement of statements) {
-      const key = statementKey(statement)
-      const hits = (merged.get(key)?.hits ?? 0) + statement.hits
-      merged.set(key, { ...statement, hits })
-    }
-  }
+  for (const { filePath, statements } of reports.flatMap(statementsOf)) {}
   return [...files].map(([filePath, merged]) => ({
     filePath,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-v1CQSF



 ❯ |mutation| property/coverage.property.ts (5 tests | 5 failed) 78ms

   ❯ mergeReports (5)

[Killed] CallExpression
scripts/crap/coverage.ts:44:5
   const files = new Map<string, Map<string, Statement>>()
   for (const { filePath, statements } of reports.flatMap(statementsOf)) {
     const merged = files.get(filePath) ?? new Map<string, Statement>()
-    files.set(filePath, merged)
+    ;
     for (const statement of statements) {
       const key = statementKey(statement)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-v1CQSF



 ❯ |mutation| scripts/crap/coverage.spec.ts (8 tests | 7 failed) 33ms

   ❯ mergeReports (8)
     × reads a statement and its hit count out of one report 22ms

[Killed] BlockStatement
scripts/crap/coverage.ts:45:41
   for (const { filePath, statements } of reports.flatMap(statementsOf)) {
     const merged = files.get(filePath) ?? new Map<string, Statement>()
     files.set(filePath, merged)
-    for (const statement of statements) {
-      const key = statementKey(statement)
-      const hits = (merged.get(key)?.hits ?? 0) + statement.hits
-      merged.set(key, { ...statement, hits })
-    }
+    for (const statement of statements) {}
   }
   return [...files].map(([filePath, merged]) => ({
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-v1CQSF


 ❯ |mutation| scripts/crap/coverage.spec.ts (8 tests | 6 failed) 65ms

   ❯ mergeReports (8)

     × reads a statement and its hit count out of one report 46ms

[Killed] ArithmeticOperator
scripts/crap/coverage.ts:47:20
     files.set(filePath, merged)
     for (const statement of statements) {
       const key = statementKey(statement)
-      const hits = (merged.get(key)?.hits ?? 0) + statement.hits
+      const hits = (merged.get(key)?.hits ?? 0) - statement.hits
       merged.set(key, { ...statement, hits })
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-v1CQSF



 ❯ |mutation| scripts/crap/coverage.spec.ts (8 tests | 4 failed) 36ms
   ❯ mergeReports (8)
     × reads a statement and its hit count out of one report 20ms
     × counts a statement as covered when any tier covered it 2ms

[Killed] ArrayDeclaration
scripts/crap/coverage.ts:53:17
   }
   return [...files].map(([filePath, merged]) => ({
     filePath,
-    statements: [...merged.values()],
+    statements: [],
   }))
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-v1CQSF



 ❯ |mutation| scripts/crap/coverage.spec.ts (8 tests | 6 failed) 51ms
   ❯ mergeReports (8)
     × reads a statement and its hit count out of one report 30ms
     × counts a statement as covered when any tier covered it 2ms
