[Killed] BlockStatement
scripts/crap/options.ts:13:26
 
 const gateFrom = (value: string | undefined): number => {
   const max = Number(value)
-  if (Number.isNaN(max)) {
-    throw new Error(`--max wants a number, got ${value ?? 'nothing'}`)
-  }
+  if (Number.isNaN(max)) {}
   return max
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| property/options.property.ts (9 tests | 1 failed) 186ms

   ❯ readOptions (6)
     × refuses a gate that is not a number, naming what it was given 34ms

[Killed] ConditionalExpression
scripts/crap/options.ts:13:7
 
 const gateFrom = (value: string | undefined): number => {
   const max = Number(value)
-  if (Number.isNaN(max)) {
+  if (false) {
     throw new Error(`--max wants a number, got ${value ?? 'nothing'}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 2 failed) 33ms

   ❯ readOptions (10)
     × refuses a --max that is not a number, naming what it got 10ms

[Killed] LogicalOperator
scripts/crap/options.ts:14:50
 const gateFrom = (value: string | undefined): number => {
   const max = Number(value)
   if (Number.isNaN(max)) {
-    throw new Error(`--max wants a number, got ${value ?? 'nothing'}`)
+    throw new Error(`--max wants a number, got ${value && 'nothing'}`)
   }
   return max
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 2 failed) 55ms

   ❯ readOptions (10)
     × refuses a --max that is not a number, naming what it got 15ms

[Killed] StringLiteral
scripts/crap/options.ts:14:59
 const gateFrom = (value: string | undefined): number => {
   const max = Number(value)
   if (Number.isNaN(max)) {
-    throw new Error(`--max wants a number, got ${value ?? 'nothing'}`)
+    throw new Error(`--max wants a number, got ${value ?? ""}`)
   }
   return max
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 59ms
   ❯ readOptions (10)
     × refuses a --max with nothing after it 26ms

[Killed] BooleanLiteral
scripts/crap/options.ts:20:56
 }
 
 export function readOptions(argv: string[]): Options {
-  const options: Options = { max: DEFAULT_GATE, reuse: false, all: false, paths: [] }
+  const options: Options = { max: DEFAULT_GATE, reuse: true, all: false, paths: [] }
   for (let index = 0; index < argv.length; index += 1) {
     const argument = argv[index]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 2 failed) 33ms

   ❯ readOptions (10)
     × gates the whole project at the default when asked for nothing 16ms

[Killed] BooleanLiteral
scripts/crap/options.ts:20:68
 }
 
 export function readOptions(argv: string[]): Options {
-  const options: Options = { max: DEFAULT_GATE, reuse: false, all: false, paths: [] }
+  const options: Options = { max: DEFAULT_GATE, reuse: false, all: true, paths: [] }
   for (let index = 0; index < argv.length; index += 1) {
     const argument = argv[index]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 2 failed) 57ms
   ❯ readOptions (10)

     × gates the whole project at the default when asked for nothing 29ms
     × reads options and paths in any order 9ms

[Killed] ConditionalExpression
scripts/crap/options.ts:21:23
 
 export function readOptions(argv: string[]): Options {
   const options: Options = { max: DEFAULT_GATE, reuse: false, all: false, paths: [] }
-  for (let index = 0; index < argv.length; index += 1) {
+  for (let index = 0; false; index += 1) {
     const argument = argv[index]
     if (argument === '--max') {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 9 failed) 35ms

   ❯ readOptions (10)
     × takes the gate from --max 7ms

[Killed] EqualityOperator
scripts/crap/options.ts:21:23
 
 export function readOptions(argv: string[]): Options {
   const options: Options = { max: DEFAULT_GATE, reuse: false, all: false, paths: [] }
-  for (let index = 0; index < argv.length; index += 1) {
+  for (let index = 0; index >= argv.length; index += 1) {
     const argument = argv[index]
     if (argument === '--max') {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 10 failed) 98ms

   ❯ readOptions (10)

[Killed] ConditionalExpression
scripts/crap/options.ts:23:9
   const options: Options = { max: DEFAULT_GATE, reuse: false, all: false, paths: [] }
   for (let index = 0; index < argv.length; index += 1) {
     const argument = argv[index]
-    if (argument === '--max') {
+    if (false) {
       index += 1
       options.max = gateFrom(argv[index])
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 5 failed) 48ms

   ❯ readOptions (10)
     × takes the gate from --max 11ms
     × reads a fractional gate, so a run can ask for more than the whole numbers 1ms

[Killed] BlockStatement
scripts/crap/options.ts:23:31
   const options: Options = { max: DEFAULT_GATE, reuse: false, all: false, paths: [] }
   for (let index = 0; index < argv.length; index += 1) {
     const argument = argv[index]
-    if (argument === '--max') {
-      index += 1
-      options.max = gateFrom(argv[index])
-    } else if (argument === '--reuse') {
+    if (argument === '--max') {} else if (argument === '--reuse') {
       options.reuse = true
     } else if (argument === '--all') {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 5 failed) 62ms

   ❯ readOptions (10)
     × takes the gate from --max 22ms

[Killed] AssignmentOperator
scripts/crap/options.ts:24:7
   for (let index = 0; index < argv.length; index += 1) {
     const argument = argv[index]
     if (argument === '--max') {
-      index += 1
+      index -= 1
       options.max = gateFrom(argv[index])
     } else if (argument === '--reuse') {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 4 failed) 56ms

   ❯ readOptions (10)
     × takes the gate from --max 20ms

[Killed] BlockStatement
scripts/crap/options.ts:26:40
     if (argument === '--max') {
       index += 1
       options.max = gateFrom(argv[index])
-    } else if (argument === '--reuse') {
-      options.reuse = true
-    } else if (argument === '--all') {
+    } else if (argument === '--reuse') {} else if (argument === '--all') {
       options.all = true
     } else if (argument.startsWith('-')) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 29ms

   ❯ readOptions (10)
     × reads --reuse and --all 14ms

[Killed] ConditionalExpression
scripts/crap/options.ts:26:16
     if (argument === '--max') {
       index += 1
       options.max = gateFrom(argv[index])
-    } else if (argument === '--reuse') {
+    } else if (true) {
       options.reuse = true
     } else if (argument === '--all') {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 5 failed) 65ms

   ❯ readOptions (10)

     × reads --reuse and --all 25ms

[Killed] BooleanLiteral
scripts/crap/options.ts:27:23
       index += 1
       options.max = gateFrom(argv[index])
     } else if (argument === '--reuse') {
-      options.reuse = true
+      options.reuse = false
     } else if (argument === '--all') {
       options.all = true
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 69ms
   ❯ readOptions (10)
     × reads --reuse and --all 26ms

[Killed] ConditionalExpression
scripts/crap/options.ts:28:16
       options.max = gateFrom(argv[index])
     } else if (argument === '--reuse') {
       options.reuse = true
-    } else if (argument === '--all') {
+    } else if (false) {
       options.all = true
     } else if (argument.startsWith('-')) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 57ms
   ❯ readOptions (10)
     × reads --reuse and --all 15ms

[Killed] EqualityOperator
scripts/crap/options.ts:28:16
       options.max = gateFrom(argv[index])
     } else if (argument === '--reuse') {
       options.reuse = true
-    } else if (argument === '--all') {
+    } else if (argument !== '--all') {
       options.all = true
     } else if (argument.startsWith('-')) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 5 failed) 74ms
   ❯ readOptions (10)
     × reads --reuse and --all 15ms
     × refuses an option it does not know, naming it 3ms

[Killed] BooleanLiteral
scripts/crap/options.ts:29:21
     } else if (argument === '--reuse') {
       options.reuse = true
     } else if (argument === '--all') {
-      options.all = true
+      options.all = false
     } else if (argument.startsWith('-')) {
       throw new Error(`unknown option ${argument}`)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 44ms

   ❯ readOptions (10)

     × reads --reuse and --all 17ms

[Killed] BlockStatement
scripts/crap/options.ts:30:42
       options.reuse = true
     } else if (argument === '--all') {
       options.all = true
-    } else if (argument.startsWith('-')) {
-      throw new Error(`unknown option ${argument}`)
-    } else {
+    } else if (argument.startsWith('-')) {} else {
       options.paths.push(argument.replace(/\/+$/, ''))
     }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 54ms
   ❯ readOptions (10)
     × refuses an option it does not know, naming it 13ms

 ❯ |mutation| property/options.property.ts (9 tests | 1 failed) 303ms

[Killed] ConditionalExpression
scripts/crap/options.ts:30:16
       options.reuse = true
     } else if (argument === '--all') {
       options.all = true
-    } else if (argument.startsWith('-')) {
+    } else if (false) {
       throw new Error(`unknown option ${argument}`)
     } else {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 53ms

   ❯ readOptions (10)
     × refuses an option it does not know, naming it 17ms

[Killed] StringLiteral
scripts/crap/options.ts:31:23
     } else if (argument === '--all') {
       options.all = true
     } else if (argument.startsWith('-')) {
-      throw new Error(`unknown option ${argument}`)
+      throw new Error(``)
     } else {
       options.paths.push(argument.replace(/\/+$/, ''))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 53ms

   ❯ readOptions (10)
     × refuses an option it does not know, naming it 31ms

[Killed] BlockStatement
scripts/crap/options.ts:32:12
       options.all = true
     } else if (argument.startsWith('-')) {
       throw new Error(`unknown option ${argument}`)
-    } else {
-      options.paths.push(argument.replace(/\/+$/, ''))
-    }
+    } else {}
   }
   return options
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| property/options.property.ts (9 tests | 2 failed) 223ms

   ❯ readOptions (6)
     × keeps the paths in the order they were given, and defaults everything unasked for 35ms
     × reads a flag wherever it appears among the paths 11ms

[Killed] StringLiteral
scripts/crap/options.ts:33:51
     } else if (argument.startsWith('-')) {
       throw new Error(`unknown option ${argument}`)
     } else {
-      options.paths.push(argument.replace(/\/+$/, ''))
+      options.paths.push(argument.replace(/\/+$/, "Stryker was here!"))
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 78ms

   ❯ readOptions (10)
     × takes the trailing slash off a path, so tab completion gates what it says 40ms

[Killed] Regex
scripts/crap/options.ts:33:43
     } else if (argument.startsWith('-')) {
       throw new Error(`unknown option ${argument}`)
     } else {
-      options.paths.push(argument.replace(/\/+$/, ''))
+      options.paths.push(argument.replace(/\/+/, ''))
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur



 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 26ms

   ❯ readOptions (10)
     × collects the paths to gate, in the order they were given 15ms

[Killed] ConditionalExpression
scripts/crap/options.ts:42:46
 // A path argument names a file or a directory to gate; without any, the gate
 // covers every measured file.
 export const isGated = (file: string, paths: string[]): boolean =>
-  paths.length === 0 || paths.some((path) => file === path || file.startsWith(`${path}/`))
+  paths.length === 0 || paths.some((path) => false)
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 3 failed) 77ms

   ❯ isGated (6)
     × gates a file named exactly 20ms
     × gates a file under a directory named 11ms

[Killed] ConditionalExpression
scripts/crap/options.ts:42:46
 // A path argument names a file or a directory to gate; without any, the gate
 // covers every measured file.
 export const isGated = (file: string, paths: string[]): boolean =>
-  paths.length === 0 || paths.some((path) => file === path || file.startsWith(`${path}/`))
+  paths.length === 0 || paths.some((path) => false || file.startsWith(`${path}/`))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Kbv5Ur


 ❯ |mutation| scripts/crap/options.spec.ts (16 tests | 1 failed) 46ms
   ❯ isGated (6)
     × gates a file named exactly 21ms

 ❯ |mutation| property/options.property.ts (9 tests | 1 failed) 246ms
