[Killed] ArrayDeclaration
scripts/crap/report.ts:15:67
   overGate: number
 }
 
-const formatRow = (file: string, entry: FunctionScore): string => [
-  `${file}:${entry.line}`.padEnd(52),
-  entry.name.padEnd(24),
-  `cc ${String(entry.complexity).padStart(3)}`,
-  `cov ${(entry.coverage * 100).toFixed(0).padStart(3)}%`,
-  `crap ${entry.crap.toFixed(1).padStart(7)}`,
-].join('  ')
+const formatRow = (file: string, entry: FunctionScore): string => [].join('  ')
 
 const summary = (
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 2 failed) 58ms
   ❯ gateReport (11)
     × reads files in path order and functions worst first 19ms
     × names the file, the line, the complexity, the coverage and the score on a row 1ms

[Killed] ArithmeticOperator
scripts/crap/report.ts:19:11
   `${file}:${entry.line}`.padEnd(52),
   entry.name.padEnd(24),
   `cc ${String(entry.complexity).padStart(3)}`,
-  `cov ${(entry.coverage * 100).toFixed(0).padStart(3)}%`,
+  `cov ${(entry.coverage / 100).toFixed(0).padStart(3)}%`,
   `crap ${entry.crap.toFixed(1).padStart(7)}`,
 ].join('  ')
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| hardening/report.hardening.ts (4 tests | 1 failed) 29ms
   ❯ a row keeps its columns apart even when the values fill them (3)
     × the whole row reads as five columns with a two-space gutter between them 21ms

[Killed] ArrowFunction
scripts/crap/report.ts:29:34
   tiers: string[],
   overGate: number,
 ): string => {
-  const functions = gated.reduce((total, entry) => total + entry.functions.length, 0)
+  const functions = gated.reduce(() => undefined, 0)
   return `\ngate CRAP <= ${max} | tiers: ${tiers.join(' + ')} | ` +
     `files: ${gated.length} | functions: ${functions} | over the gate: ${overGate}`
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 2 failed) 69ms

   ❯ gateReport (11)
     × summarises the gate, the tiers it merged, and what it measured 14ms
     × measures only the files under the paths it was given 5ms

[Killed] ArithmeticOperator
scripts/crap/report.ts:29:52
   tiers: string[],
   overGate: number,
 ): string => {
-  const functions = gated.reduce((total, entry) => total + entry.functions.length, 0)
+  const functions = gated.reduce((total, entry) => total - entry.functions.length, 0)
   return `\ngate CRAP <= ${max} | tiers: ${tiers.join(' + ')} | ` +
     `files: ${gated.length} | functions: ${functions} | over the gate: ${overGate}`
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 2 failed) 47ms
   ❯ gateReport (11)
     × summarises the gate, the tiers it merged, and what it measured 10ms
     × measures only the files under the paths it was given 10ms

[Killed] MethodExpression
scripts/crap/report.ts:41:17
   options: Options,
   tiers: string[],
 ): GateReport {
-  const gated = measured
-    .filter((entry) => isGated(entry.file, options.paths))
-    .sort((left, right) => left.file.localeCompare(right.file))
+  const gated = measured.filter(entry => isGated(entry.file, options.paths))
 
   if (gated.length === 0) {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 2 failed) 55ms

   ❯ gateReport (11)

[Killed] MethodExpression
scripts/crap/report.ts:41:17
   options: Options,
   tiers: string[],
 ): GateReport {
-  const gated = measured
-    .filter((entry) => isGated(entry.file, options.paths))
+  const gated = measured
     .sort((left, right) => left.file.localeCompare(right.file))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 2 failed) 78ms
   ❯ gateReport (11)
     × measures only the files under the paths it was given 23ms
     × refuses a path it measured nothing under, naming the path 2ms

[Killed] ArrowFunction
scripts/crap/report.ts:42:13
   tiers: string[],
 ): GateReport {
   const gated = measured
-    .filter((entry) => isGated(entry.file, options.paths))
+    .filter(() => undefined)
     .sort((left, right) => left.file.localeCompare(right.file))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 9 failed) 29ms
   ❯ gateReport (11)
     × lists only the functions over the gate 18ms
     × leaves a function exactly at the gate alone: the gate is <= 1ms
     × lists every function when asked for all of them 0ms

[Killed] BlockStatement
scripts/crap/report.ts:45:27
     .filter((entry) => isGated(entry.file, options.paths))
     .sort((left, right) => left.file.localeCompare(right.file))
 
-  if (gated.length === 0) {
-    throw new Error(`no measured files under ${options.paths.join(', ') || 'the project'}`)
-  }
+  if (gated.length === 0) {}
 
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| hardening/report.hardening.ts (4 tests | 1 failed) 43ms

   ❯ the refusal names every path it was asked about (1)
     × several paths are listed, separated, in the order they were given 28ms

[Killed] ConditionalExpression
scripts/crap/report.ts:45:7
     .filter((entry) => isGated(entry.file, options.paths))
     .sort((left, right) => left.file.localeCompare(right.file))
 
-  if (gated.length === 0) {
+  if (true) {
     throw new Error(`no measured files under ${options.paths.join(', ') || 'the project'}`)
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 9 failed) 80ms

   ❯ gateReport (11)
     × lists only the functions over the gate 58ms
     × leaves a function exactly at the gate alone: the gate is <= 1ms

[Killed] ConditionalExpression
scripts/crap/report.ts:46:48
     .sort((left, right) => left.file.localeCompare(right.file))
 
   if (gated.length === 0) {
-    throw new Error(`no measured files under ${options.paths.join(', ') || 'the project'}`)
+    throw new Error(`no measured files under ${false}`)
   }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| hardening/report.hardening.ts (4 tests | 1 failed) 42ms

   ❯ the refusal names every path it was asked about (1)
     × several paths are listed, separated, in the order they were given 23ms

[Killed] LogicalOperator
scripts/crap/report.ts:46:48
     .sort((left, right) => left.file.localeCompare(right.file))
 
   if (gated.length === 0) {
-    throw new Error(`no measured files under ${options.paths.join(', ') || 'the project'}`)
+    throw new Error(`no measured files under ${options.paths.join(', ') && 'the project'}`)
   }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| hardening/report.hardening.ts (4 tests | 1 failed) 47ms
   ❯ the refusal names every path it was asked about (1)
     × several paths are listed, separated, in the order they were given 32ms

[Killed] ConditionalExpression
scripts/crap/report.ts:49:57
     throw new Error(`no measured files under ${options.paths.join(', ') || 'the project'}`)
   }
 
-  const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
+  const isOverGate = (entry: FunctionScore): boolean => true
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
   const lines = gated.flatMap(({ file, functions }) => functions
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 6 failed) 140ms
   ❯ gateReport (11)
     × lists only the functions over the gate 90ms
     × leaves a function exactly at the gate alone: the gate is <= 14ms
     × counts the functions over the gate 1ms

[Killed] ConditionalExpression
scripts/crap/report.ts:49:57
     throw new Error(`no measured files under ${options.paths.join(', ') || 'the project'}`)
   }
 
-  const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
+  const isOverGate = (entry: FunctionScore): boolean => false
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
   const lines = gated.flatMap(({ file, functions }) => functions
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| hardening/report.hardening.ts (4 tests | 3 failed) 60ms
   ❯ a row keeps its columns apart even when the values fill them (3)
     × the location and the name are separated 25ms
     × the name and the complexity are separated 13ms
     × the whole row reads as five columns with a two-space gutter betw

[Killed] ArrowFunction
scripts/crap/report.ts:50:35
   }
 
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
-  const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
+  const offenders = gated.flatMap(() => undefined)
   const lines = gated.flatMap(({ file, functions }) => functions
     .filter((entry) => options.all || isOverGate(entry))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 1 failed) 71ms

   ❯ gateReport (11)
     × reports nothing over the gate when the gate is wide enough 15ms

[Killed] MethodExpression
scripts/crap/report.ts:50:54
   }
 
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
-  const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
+  const offenders = gated.flatMap(({ functions }) => functions)
   const lines = gated.flatMap(({ file, functions }) => functions
     .filter((entry) => options.all || isOverGate(entry))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 4 failed) 111ms

   ❯ gateReport (11)
     × counts the functions over the gate 16ms
     × reports nothing over the gate when the gate is wide enough 1ms

[Killed] MethodExpression
scripts/crap/report.ts:51:56
 
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
-  const lines = gated.flatMap(({ file, functions }) => functions
-    .filter((entry) => options.all || isOverGate(entry))
+  const lines = gated.flatMap(({ file, functions }) => functions
     .sort((left, right) => right.crap - left.crap)
     .map((entry) => formatRow(file, entry)))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 3 failed) 84ms
   ❯ gateReport (11)
     × lists only the functions over the gate 46ms
     × leaves a function exactly at the gate alone: the gate is <= 10ms
     × reports nothing over the gate when the gate is wide enough 2ms

[Killed] MethodExpression
scripts/crap/report.ts:51:56
 
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
-  const lines = gated.flatMap(({ file, functions }) => functions
-    .filter((entry) => options.all || isOverGate(entry))
-    .sort((left, right) => right.crap - left.crap)
+  const lines = gated.flatMap(({ file, functions }) => functions.filter(entry => options.all || isOverGate(entry))
     .map((entry) => formatRow(file, entry)))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 1 failed) 90ms

   ❯ gateReport (11)
     × reads files in path order and functions worst first 32ms

[Killed] ConditionalExpression
scripts/crap/report.ts:52:24
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
   const lines = gated.flatMap(({ file, functions }) => functions
-    .filter((entry) => options.all || isOverGate(entry))
+    .filter((entry) => true)
     .sort((left, right) => right.crap - left.crap)
     .map((entry) => formatRow(file, entry)))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 3 failed) 113ms

   ❯ gateReport (11)

     × lists only the functions over the gate 63ms

[Killed] LogicalOperator
scripts/crap/report.ts:52:24
   const isOverGate = (entry: FunctionScore): boolean => entry.crap > options.max
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
   const lines = gated.flatMap(({ file, functions }) => functions
-    .filter((entry) => options.all || isOverGate(entry))
+    .filter((entry) => options.all && isOverGate(entry))
     .sort((left, right) => right.crap - left.crap)
     .map((entry) => formatRow(file, entry)))
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM



 ❯ |mutation| hardening/report.hardening.ts (4 tests | 3 failed) 40ms
   ❯ a row keeps its columns apart even when the values fill them (3)
     × the location and the name are separated 13ms
     × the name and the complexity are separated 13ms

[Killed] ArithmeticOperator
scripts/crap/report.ts:53:28
   const offenders = gated.flatMap(({ functions }) => functions.filter(isOverGate))
   const lines = gated.flatMap(({ file, functions }) => functions
     .filter((entry) => options.all || isOverGate(entry))
-    .sort((left, right) => right.crap - left.crap)
+    .sort((left, right) => right.crap + left.crap)
     .map((entry) => formatRow(file, entry)))
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-Xty3VM


 ❯ |mutation| scripts/crap/report.spec.ts (11 tests | 1 failed) 154ms
   ❯ gateReport (11)

     × reads files in path order and functions worst first 90ms
