[Killed] ConditionalExpression
scripts/crap/score.ts:14:22
 }
 
 const contains = (span: Span, position: Position): boolean => {
-  const afterStart = position.line > span.start.line ||
-    (position.line === span.start.line && position.column >= span.start.column)
+  const afterStart = false
   const beforeEnd = position.line < span.end.line ||
     (position.line === span.end.line && position.column <= span.end.column)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| property/score.property.ts (6 tests | 3 failed) 113ms

   ❯ scoreFunctions (6)
     × is the CRAP formula over the statements the function holds 29ms

[Killed] ConditionalExpression
scripts/crap/score.ts:14:22
 }
 
 const contains = (span: Span, position: Position): boolean => {
-  const afterStart = position.line > span.start.line ||
+  const afterStart = false ||
     (position.line === span.start.line && position.column >= span.start.column)
   const beforeEnd = position.line < span.end.line ||
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 3 failed) 15ms

   ❯ which positions a function span holds (8)
     × the last character of the function is inside it 6ms

[Killed] ConditionalExpression
scripts/crap/score.ts:15:6
 
 const contains = (span: Span, position: Position): boolean => {
   const afterStart = position.line > span.start.line ||
-    (position.line === span.start.line && position.column >= span.start.column)
+    (true && position.column >= span.start.column)
   const beforeEnd = position.line < span.end.line ||
     (position.line === span.end.line && position.column <= span.end.column)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| hardening/score.hardening.ts (11 tests | 1 failed) 29ms
   ❯ which positions a function span holds (8)
     × an earlier line is outside, however far along that line it sits 10ms

[Killed] EqualityOperator
scripts/crap/score.ts:15:43
 
 const contains = (span: Span, position: Position): boolean => {
   const afterStart = position.line > span.start.line ||
-    (position.line === span.start.line && position.column >= span.start.column)
+    (position.line === span.start.line && position.column > span.start.column)
   const beforeEnd = position.line < span.end.line ||
     (position.line === span.end.line && position.column <= span.end.column)
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 1 failed) 40ms
   ❯ which positions a function span holds (8)

     × the first character of the function is inside it 23ms

[Killed] ConditionalExpression
scripts/crap/score.ts:16:21
 const contains = (span: Span, position: Position): boolean => {
   const afterStart = position.line > span.start.line ||
     (position.line === span.start.line && position.column >= span.start.column)
-  const beforeEnd = position.line < span.end.line ||
-    (position.line === span.end.line && position.column <= span.end.column)
+  const beforeEnd = false
   return afterStart && beforeEnd
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 7 failed) 69ms

   ❯ which positions a function span holds (8)
     × the first character of the function is inside it 27ms

[Killed] ConditionalExpression
scripts/crap/score.ts:16:21
 const contains = (span: Span, position: Position): boolean => {
   const afterStart = position.line > span.start.line ||
     (position.line === span.start.line && position.column >= span.start.column)
-  const beforeEnd = position.line < span.end.line ||
+  const beforeEnd = false ||
     (position.line === span.end.line && position.column <= span.end.column)
   return afterStart && beforeEnd
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 6 failed) 65ms
   ❯ scoreFunctions (8)
     × scores an uncovered function at cc^2 + cc 27ms
     × scores a half-covered function between the two 1ms

[Killed] ConditionalExpression
scripts/crap/score.ts:17:6
   const afterStart = position.line > span.start.line ||
     (position.line === span.start.line && position.column >= span.start.column)
   const beforeEnd = position.line < span.end.line ||
-    (position.line === span.end.line && position.column <= span.end.column)
+    (false)
   return afterStart && beforeEnd
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 4 failed) 54ms

   ❯ which positions a function span holds (8)
     × the last character of the function is inside it 26ms

[Killed] LogicalOperator
scripts/crap/score.ts:17:6
   const afterStart = position.line > span.start.line ||
     (position.line === span.start.line && position.column >= span.start.column)
   const beforeEnd = position.line < span.end.line ||
-    (position.line === span.end.line && position.column <= span.end.column)
+    (position.line === span.end.line || position.column <= span.end.column)
   return afterStart && beforeEnd
 }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 2 failed) 38ms
   ❯ which positions a function span holds (8)
     × the character after the last, on the closing line, is outside 14ms
     × a later line is outside 13ms

[Killed] ConditionalExpression
scripts/crap/score.ts:18:10
     (position.line === span.start.line && position.column >= span.start.column)
   const beforeEnd = position.line < span.end.line ||
     (position.line === span.end.line && position.column <= span.end.column)
-  return afterStart && beforeEnd
+  return true
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 4 failed) 34ms

   ❯ which positions a function span holds (8)
     × the character before it on the same line is outside 12ms

[Killed] ConditionalExpression
scripts/crap/score.ts:18:10
     (position.line === span.start.line && position.column >= span.start.column)
   const beforeEnd = position.line < span.end.line ||
     (position.line === span.end.line && position.column <= span.end.column)
-  return afterStart && beforeEnd
+  return false
 }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 7 failed) 28ms

   ❯ which positions a function span holds (8)
     × the first character of the function is inside it 10ms

[Killed] ArithmeticOperator
scripts/crap/score.ts:22:3
 }
 
 const spanSize = (span: Span): number =>
-  (span.end.line - span.start.line) * 1e6 + span.end.column
+  (span.end.line - span.start.line) * 1e6 - span.end.column
 
 const innermostContaining = <Scoped extends { span: Span }>(
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| hardening/score.hardening.ts (11 tests | 1 failed) 46ms

   ❯ which of two containing functions is the innermost (3)

     × two spans on one line are ordered by where they end 28ms

[Killed] ArithmeticOperator
scripts/crap/score.ts:22:4
 }
 
 const spanSize = (span: Span): number =>
-  (span.end.line - span.start.line) * 1e6 + span.end.column
+  (span.end.line + span.start.line) * 1e6 + span.end.column
 
 const innermostContaining = <Scoped extends { span: Span }>(
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| hardening/score.hardening.ts (11 tests | 1 failed) 26ms
   ❯ which of two containing functions is the innermost (3)

     × a span is measured by the lines it covers, not by how far down the file it sits 12ms

[Killed] MethodExpression
scripts/crap/score.ts:27:26
 const innermostContaining = <Scoped extends { span: Span }>(
   candidates: Scoped[],
   position: Position,
-): Scoped | undefined => candidates
-  .filter((candidate) => contains(candidate.span, position))
+): Scoped | undefined => candidates
   .sort((left, right) => spanSize(left.span) - spanSize(right.span))[0]
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| hardening/score.hardening.ts (11 tests | 4 failed) 41ms
   ❯ which positions a function span holds (8)
     × the character before it on the same line is outside 23ms
     × an earlier line is outside, however far along that line it sits 1ms

[Killed] MethodExpression
scripts/crap/score.ts:27:26
 const innermostContaining = <Scoped extends { span: Span }>(
   candidates: Scoped[],
   position: Position,
-): Scoped | undefined => candidates
-  .filter((candidate) => contains(candidate.span, position))
-  .sort((left, right) => spanSize(left.span) - spanSize(right.span))[0]
+): Scoped | undefined => candidates.filter(candidate => contains(candidate.span, position))[0]
 
 const crapOf = (complexity: number, coverage: number): number =>
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| hardening/score.hardening.ts (11 tests | 3 failed) 80ms

   ❯ which of two containing functions is the innermost (3)
     × two spans on one line are ordered by where they end 27ms
     × a short span ending far along its line is smaller than a tall span ending at column 1 1ms

[Killed] ArrowFunction
scripts/crap/score.ts:28:11
   candidates: Scoped[],
   position: Position,
 ): Scoped | undefined => candidates
-  .filter((candidate) => contains(candidate.span, position))
+  .filter(() => undefined)
   .sort((left, right) => spanSize(left.span) - spanSize(right.span))[0]
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 6 failed) 35ms

   ❯ scoreFunctions (8)
     × scores an uncovered function at cc^2 + cc 14ms
     × scores a half-covered function between the two 1ms

[Killed] ArithmeticOperator
scripts/crap/score.ts:29:26
   position: Position,
 ): Scoped | undefined => candidates
   .filter((candidate) => contains(candidate.span, position))
-  .sort((left, right) => spanSize(left.span) - spanSize(right.span))[0]
+  .sort((left, right) => spanSize(left.span) + spanSize(right.span))[0]
 
 const crapOf = (complexity: number, coverage: number): number =>
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| hardening/score.hardening.ts (11 tests | 3 failed) 36ms
   ❯ which of two containing functions is the innermost (3)
     × two spans on one line are ordered by where they end 19ms
     × a short span ending far along its line is smaller than a tall span ending at column 1 2ms
     × a span is measured

[Killed] ArithmeticOperator
scripts/crap/score.ts:32:22
   .sort((left, right) => spanSize(left.span) - spanSize(right.span))[0]
 
 const crapOf = (complexity: number, coverage: number): number =>
-  complexity ** 2 * (1 - coverage) ** 3 + complexity
+  complexity ** 2 * (1 + coverage) ** 3 + complexity
 
 // A statement counts towards the innermost function containing it. A function
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 3 failed) 35ms
   ❯ scoreFunctions (8)
     × scores a fully covered function at its complexity: the risk term falls away 23ms
     × scores a half-covered function between the two 1ms

[Killed] ArithmeticOperator
scripts/crap/score.ts:32:3
   .sort((left, right) => spanSize(left.span) - spanSize(right.span))[0]
 
 const crapOf = (complexity: number, coverage: number): number =>
-  complexity ** 2 * (1 - coverage) ** 3 + complexity
+  complexity ** 2 * (1 - coverage) ** 3 - complexity
 
 // A statement counts towards the innermost function containing it. A function
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| property/score.property.ts (6 tests | 3 failed) 156ms

   ❯ scoreFunctions (6)
     × is the CRAP formula over the statements the function holds 26ms

[Killed] BlockStatement
scripts/crap/score.ts:43:45
 ): FunctionScore[] {
   const tallied = functions.map((entry) => ({ ...entry, total: 0, covered: 0 }))
 
-  for (const { start, hits } of statements) {
-    const owner = innermostContaining(tallied, start)
-    if (!owner) {
-      continue
-    }
-    owner.total += 1
-    owner.covered += hits > 0 ? 1 : 0
-  }
+  for (const { start, hits } of statements) {}
 
   return tallied.map(({ name, span, complexity, total, covered }) => {
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 6 failed) 84ms
   ❯ scoreFunctions (8)

     × scores an uncovered function at cc^2 + cc 24ms

[Killed] AssignmentOperator
scripts/crap/score.ts:48:5
     if (!owner) {
       continue
     }
-    owner.total += 1
+    owner.total -= 1
     owner.covered += hits > 0 ? 1 : 0
   }
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| property/score.property.ts (6 tests | 4 failed) 72ms
   ❯ scoreFunctions (6)
     × is the CRAP formula over the statements the function holds 22ms
     × scores a fully covered function at its complexity, and an untouched one at cc squared plus cc 6ms
     × never scores a function worse for having co

[Killed] ConditionalExpression
scripts/crap/score.ts:49:22
       continue
     }
     owner.total += 1
-    owner.covered += hits > 0 ? 1 : 0
+    owner.covered += false ? 1 : 0
   }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 4 failed) 59ms

   ❯ scoreFunctions (8)
     × scores a fully covered function at its complexity: the risk term falls away 33ms
     × scores a half-covered function between the two 1ms

[Killed] EqualityOperator
scripts/crap/score.ts:49:22
       continue
     }
     owner.total += 1
-    owner.covered += hits > 0 ? 1 : 0
+    owner.covered += hits >= 0 ? 1 : 0
   }
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 6 failed) 53ms
   ❯ scoreFunctions (8)
     × scores an uncovered function at cc^2 + cc 23ms
     × scores a half-covered function between the two 6ms

[Killed] ConditionalExpression
scripts/crap/score.ts:53:22
   }
 
   return tallied.map(({ name, span, complexity, total, covered }) => {
-    const coverage = total === 0 ? 1 : covered / total
+    const coverage = true ? 1 : covered / total
     return {
       name,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0


 ❯ |mutation| scripts/crap/score.spec.ts (12 tests | 6 failed) 48ms

   ❯ scoreFunctions (8)

     × scores an uncovered function at cc^2 + cc 15ms

[Killed] EqualityOperator
scripts/crap/score.ts:53:22
   }
 
   return tallied.map(({ name, span, complexity, total, covered }) => {
-    const coverage = total === 0 ? 1 : covered / total
+    const coverage = total !== 0 ? 1 : covered / total
     return {
       name,
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-jJ5cs0



 ❯ |mutation| property/score.property.ts (6 tests | 4 failed) 218ms

   ❯ scoreFunctions (6)
