[Killed] ArrayDeclaration
scripts/crap/tiers.ts:18:40
 // for no change in any number. `tiers.spec.ts` holds the other half of that
 // decision: a tier that does measure the same sources has to be listed here,
 // or the gate would score functions on less coverage than the project has.
-export const MEASURING_TIERS: Tier[] = [
-  { name: 'unit', config: 'vite.config.ts' },
-  { name: 'property', config: 'vitest.property.config.ts' },
-  { name: 'hardening', config: 'vitest.hardening.config.ts' },
-]
+export const MEASURING_TIERS: Tier[] = []
 
 // Project-relative, and one directory per tier, so one tier's report cannot
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-CuE5Gd



 ❯ |mutation| hardening/tiers.hardening.ts (1 test | 1 failed) 19ms
   ❯ every tier is named, and its name keeps its report to itself (1)
     × the tiers are named for the commands a reader runs to reproduce them 17ms

[Killed] StringLiteral
scripts/crap/tiers.ts:19:27
 // decision: a tier that does measure the same sources has to be listed here,
 // or the gate would score functions on less coverage than the project has.
 export const MEASURING_TIERS: Tier[] = [
-  { name: 'unit', config: 'vite.config.ts' },
+  { name: 'unit', config: "" },
   { name: 'property', config: 'vitest.property.config.ts' },
   { name: 'hardening', config: 'vitest.hardening.config.ts' },
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-CuE5Gd



 ❯ |mutation| scripts/crap/tiers.spec.ts (5 tests | 1 failed) 21ms
   ❯ the tiers the gate merges (2)
     × is every config that measures what the gate scores 19ms

[Killed] StringLiteral
scripts/crap/tiers.ts:20:11
 // or the gate would score functions on less coverage than the project has.
 export const MEASURING_TIERS: Tier[] = [
   { name: 'unit', config: 'vite.config.ts' },
-  { name: 'property', config: 'vitest.property.config.ts' },
+  { name: "", config: 'vitest.property.config.ts' },
   { name: 'hardening', config: 'vitest.hardening.config.ts' },
 ]
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-CuE5Gd



 ❯ |mutation| hardening/tiers.hardening.ts (7 tests | 2 failed) 28ms

   ❯ every tier is named, and its name keeps its report to itself (7)

[Killed] StringLiteral
scripts/crap/tiers.ts:21:32
 export const MEASURING_TIERS: Tier[] = [
   { name: 'unit', config: 'vite.config.ts' },
   { name: 'property', config: 'vitest.property.config.ts' },
-  { name: 'hardening', config: 'vitest.hardening.config.ts' },
+  { name: 'hardening', config: "" },
 ]
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-CuE5Gd


 ❯ |mutation| scripts/crap/tiers.spec.ts (5 tests | 1 failed) 38ms

   ❯ the tiers the gate merges (2)
     × is every config that measures what the gate scores 35ms

[Killed] StringLiteral
scripts/crap/tiers.ts:21:11
 export const MEASURING_TIERS: Tier[] = [
   { name: 'unit', config: 'vite.config.ts' },
   { name: 'property', config: 'vitest.property.config.ts' },
-  { name: 'hardening', config: 'vitest.hardening.config.ts' },
+  { name: "", config: 'vitest.hardening.config.ts' },
 ]
 
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-CuE5Gd



 ❯ |mutation| hardening/tiers.hardening.ts (7 tests | 2 failed) 49ms

   ❯ every tier is named, and its name keeps its report to itself (7)
     ×  reports below the coverage root, not into it 3ms

[Killed] StringLiteral
scripts/crap/tiers.ts:27:61
 // Project-relative, and one directory per tier, so one tier's report cannot
 // overwrite another's and a manual `vitest run --coverage` into the default
 // `coverage/` is ignored.
-export const reportDirectory = (tier: Tier): string => join('coverage', tier.name)
+export const reportDirectory = (tier: Tier): string => join("", tier.name)
 
 export const reportFile = (tier: Tier): string =>
killedBy: All tests
statusReason: RUN  v5.0.0 /home/user/todomvc-redux-typescript/build/stryker-tmp/sandbox-CuE5Gd


 ❯ |mutation| hardening/tiers.hardening.ts (7 tests | 3 failed) 50ms

   ❯ every tier is named, and its name keeps its report to itself (7)

     × unit reports below the coverage root, not into it 18ms
